lang-spec.org
#+title: Fn Language Specification
#+author: Jack Pugmire

* About this Document

This document fully specifies the syntax and semantics of the Fn programming
language. Any part of it may be changed at any time. Since the interpreter is
still unfinished, its actual behavior may differ from what's described here.

Section [[Language Description]] contains a description of the semantics of Fn. It's
meant to read like a user's manual, and should cover everything about the core
language when it's done. I'm trying to make this readable.

After this comes the technical part of the document. It's a big old list of all
the types of expressions in Fn with precise descriptions of their behaviors.

Following this is the lexical analysis section. This rounds out the
specification by giving a character-by-character description of Fn syntax. I'm
planning to rewrite this at some point. It's in rough shape after repeated
cut-and-pastes from different documents.

At the end is some other miscellaneous stuff I copied from old design documents
because I didn't want to delete it from the main repository yet.

There will be more sections (and subsections!) in the future.


* Language Description

** Overview

Fn is a dynamically typed, garbage-collected, general-purpose programming
language with Lisp-like syntax. A couple of its defining characteristics are:
- The core language has relatively few operators, with special care taken to
  ensure they have consistent and concise syntax.
- Fn is designed for a "mostly functional" programming style, where immutability
  and referential transparency are favored, but not required.
- The native macro system allows definition of new syntax (and even entire
  domain-specific languages) using regular Fn code and data structures.

The syntax looks like this:

#+BEGIN_SRC fn
(def sqrt-precision 0.001)
(def approx-sqrt (x)
  (letfn iterate (guess)
    (if (< (abs (- x (* guess guess)) sqrt-precision))
        guess
        (iterate (/ (+ guess (/ x guess) 2)))))
  (if (>= x 0)
      (iterate (/ x 2))
      (error "Cannot approximate square root of a negative number.")))
#+END_SRC


** Variables and Mutation

