lang-spec.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-12 Sun 21:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fn Language Specification</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jack Pugmire" />
</head>
<body>
<div id="content">
<h1 class="title">Fn Language Specification</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org12c11b0">1. About this Document</a></li>
<li><a href="#org81e3feb">2. Language Description</a>
<ul>
<li><a href="#org8076228">2.1. Overview</a></li>
<li><a href="#orga18f600">2.2. Variables and Mutation</a>
<ul>
<li><a href="#org18c59eb">2.2.1. Local Variables</a></li>
<li><a href="#org6e47629">2.2.2. Global Variables</a></li>
</ul>
</li>
<li><a href="#orgcd88626">2.3. Data Types</a>
<ul>
<li><a href="#org1d6fd5b">2.3.1. Simple Data Types</a></li>
<li><a href="#orgdb0d21e">2.3.2. Lists</a></li>
<li><a href="#org04383f0">2.3.3. <span class="todo TODO">TODO</span> Tables</a></li>
<li><a href="#org451b875">2.3.4. Quoting</a></li>
</ul>
</li>
<li><a href="#org4a08bbb">2.4. Control Flow and Functions</a>
<ul>
<li><a href="#orge602e03">2.4.1. Conditional Execution</a></li>
<li><a href="#orgc633385">2.4.2. Creating Functions</a></li>
<li><a href="#orgd535b78">2.4.3. Function Calls</a></li>
<li><a href="#org45c5c99">2.4.4. Variable Capture</a></li>
<li><a href="#org31a627f">2.4.5. dollar-fn</a></li>
</ul>
</li>
<li><a href="#org4ef2e1f">2.5. Namespaces and Import</a>
<ul>
<li><a href="#org062af04">2.5.1. Namespaces and Packages</a></li>
<li><a href="#orgf8b012b">2.5.2. Import</a></li>
<li><a href="#org2d5b6cc">2.5.3. Package Declarations</a></li>
<li><a href="#orgbeb4a64">2.5.4. Global Names</a></li>
</ul>
</li>
<li><a href="#orgc860825">2.6. Macros</a>
<ul>
<li><a href="#org151c9bb">2.6.1. Macro Basics</a></li>
<li><a href="#orgedea835">2.6.2. Quasiquotation</a></li>
<li><a href="#org532fff5">2.6.3. Variable Capture and <code>gensym</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb30bf51">3. Formal Semantics</a>
<ul>
<li><a href="#orge23f878">3.1. Immediate Expressions and Variables</a></li>
<li><a href="#org608aa34">3.2. Special forms</a>
<ul>
<li><a href="#org3063742">3.2.1. and</a></li>
<li><a href="#orgcac6e1d">3.2.2. cond</a></li>
<li><a href="#orgf99f502">3.2.3. def</a></li>
<li><a href="#org25e9743">3.2.4. <span class="todo TODO">TODO</span> defmacro</a></li>
<li><a href="#orgdf8a17b">3.2.5. defn</a></li>
<li><a href="#org5753480">3.2.6. do</a></li>
<li><a href="#org7055cb6">3.2.7. do-inline</a></li>
<li><a href="#org9c49533">3.2.8. <span class="todo TODO">TODO</span> dot</a></li>
<li><a href="#org0539cf2">3.2.9. dollar-fn</a></li>
<li><a href="#orge3165a1">3.2.10. if</a></li>
<li><a href="#orge4abed7">3.2.11. <span class="todo TODO">TODO</span> import</a></li>
<li><a href="#org3036346">3.2.12. fn</a></li>
<li><a href="#orga4a4e6b">3.2.13. let</a></li>
<li><a href="#org8946817">3.2.14. <span class="todo TODO">TODO</span> letfn</a></li>
<li><a href="#orgbf6d702">3.2.15. or</a></li>
<li><a href="#orgd17dcee">3.2.16. quasiquote</a></li>
<li><a href="#orgbc161c5">3.2.17. quote</a></li>
<li><a href="#org1eec86f">3.2.18. unquote</a></li>
<li><a href="#orgc406618">3.2.19. unquote-splicing</a></li>
<li><a href="#org19d854f">3.2.20. <span class="todo TODO">TODO</span> set!</a></li>
<li><a href="#org4b2ad70">3.2.21. with</a></li>
</ul>
</li>
<li><a href="#orgf351f4e">3.3. Function Calls</a></li>
<li><a href="#org6ec37a6">3.4. Macro Calls</a></li>
</ul>
</li>
<li><a href="#orgc6efc1f">4. Lexical Analysis</a>
<ul>
<li><a href="#org66f1f76">4.1. Comments</a></li>
<li><a href="#org99398bb">4.2. Numbers, Symbols, and Dots</a></li>
<li><a href="#org9dd3ecd">4.3. <span class="todo TODO">TODO</span> String Literals</a></li>
<li><a href="#org9a0c5da">4.4. Source Encoding</a></li>
</ul>
</li>
<li><a href="#org172b6f0">5. <span class="todo TODO">TODO</span> Built-in Functions</a>
<ul>
<li><a href="#orge46892f">5.1. Primitive Functions</a></li>
<li><a href="#org8fec1f1">5.2. Nonprimitive functions</a></li>
</ul>
</li>
<li><a href="#orgd3cff92">6. Future Extensions</a>
<ul>
<li><a href="#org48649ef">6.1. Pattern Destructuring in <code>def</code> and <code>let</code></a></li>
<li><a href="#org2e3b089">6.2. (Proposed) <code>#</code>-Syntax for Collections</a></li>
<li><a href="#org7612b20">6.3. Global Names for Definitions</a></li>
<li><a href="#org0641665">6.4. (Proposed) <code>,:</code>-Syntax for Global Names in Quasiquote</a></li>
<li><a href="#org745fc2d">6.5. (Proposed) Multiple Return Values</a></li>
<li><a href="#org3e3acab">6.6. Schemas, Metatables, and Table Calls</a></li>
<li><a href="#orgdcae0c5">6.7. (Proposed) Table Immutability Rules</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org12c11b0" class="outline-2">
<h2 id="org12c11b0"><span class="section-number-2">1</span> About this Document</h2>
<div class="outline-text-2" id="text-1">
<p>
This document fully specifies the syntax and semantics of the Fn programming
language. Any part of it may be changed at any time. Since the interpreter is
still unfinished, its actual behavior may differ from what's described here.
</p>

<p>
Section <a href="#org81e3feb">2</a> contains a description of the semantics of Fn. It's
meant to read like a user's manual, and should cover everything about the core
language when it's done. I'm trying to make this readable.
</p>

<p>
After this comes the technical part of the document. It's a big old list of all
the types of expressions in Fn with precise descriptions of their behaviors.
</p>

<p>
Following this is the lexical analysis section. This rounds out the
specification by giving a character-by-character description of Fn syntax. I'm
planning to rewrite this at some point. It's in rough shape after repeated
cut-and-pastes from different documents.
</p>

<p>
At the end is some other miscellaneous stuff I copied from old design documents
because I didn't want to delete it from the main repository yet.
</p>

<p>
There will be more sections (and subsections!) in the future.
</p>
</div>
</div>


<div id="outline-container-org81e3feb" class="outline-2">
<h2 id="org81e3feb"><span class="section-number-2">2</span> Language Description</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8076228" class="outline-3">
<h3 id="org8076228"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Fn is a dynamically typed, garbage-collected, general-purpose programming
language with Lisp-like syntax. A couple of its defining characteristics are:
</p>
<ul class="org-ul">
<li>The core language has relatively few operators, with special care taken to
ensure they have consistent and concise syntax.</li>
<li>Fn is designed for a "mostly functional" programming style, where immutability
and referential transparency are favored, but not required.</li>
<li>The native macro system allows definition of new syntax (and even entire
domain-specific languages) using regular Fn code and data structures.</li>
</ul>

<p>
The syntax looks like this:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> sqrt-precision 0.001<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> approx-sqrt <span style="color: #7388d6;">(</span>x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">letfn</span> <span style="color: #cd9b1d;">iterate</span> <span style="color: #909183;">(</span>guess<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #709870;">(</span>&lt; <span style="color: #907373;">(</span>abs <span style="color: #6276ba;">(</span>- x <span style="color: #858580;">(</span>* guess guess<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> sqrt-precision<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        guess
        <span style="color: #709870;">(</span>iterate <span style="color: #907373;">(</span>/ <span style="color: #6276ba;">(</span>+ guess <span style="color: #858580;">(</span>/ x guess<span style="color: #858580;">)</span> 2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #909183;">(</span>&gt;= x 0<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>iterate <span style="color: #709870;">(</span>/ x 2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b7355;">"Cannot approximate square root of a negative number."</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orga18f600" class="outline-3">
<h3 id="orga18f600"><span class="section-number-3">2.2</span> Variables and Mutation</h3>
<div class="outline-text-3" id="text-2-2">
</div>
