lang-spec.tex
% Created 2021-12-12 Sun 20:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jack Pugmire}
\date{\today}
\title{Fn Language Specification}
\hypersetup{
 pdfauthor={Jack Pugmire},
 pdftitle={Fn Language Specification},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{About this Document}
\label{sec:orge8c6f6a}

This document fully specifies the syntax and semantics of the Fn programming
language. Any part of it may be changed at any time. Since the interpreter is
still unfinished, its actual behavior may differ from what's described here.

Section \ref{sec:orgbc0d4fa} contains a description of the semantics of Fn. It's
meant to read like a user's manual, and should cover everything about the core
language when it's done. I'm trying to make this readable.

After this comes the technical part of the document. It's a big old list of all
the types of expressions in Fn with precise descriptions of their behaviors.

Following this is the lexical analysis section. This rounds out the
specification by giving a character-by-character description of Fn syntax. I'm
planning to rewrite this at some point. It's in rough shape after repeated
cut-and-pastes from different documents.

At the end is some other miscellaneous stuff I copied from old design documents
because I didn't want to delete it from the main repository yet.

There will be more sections (and subsections!) in the future.


\section{Language Description}
\label{sec:orgbc0d4fa}

\subsection{Overview}
\label{sec:org91300c7}

Fn is a dynamically typed, garbage-collected, general-purpose programming
language with Lisp-like syntax. A couple of its defining characteristics are:
\begin{itemize}
\item The core language has relatively few operators, with special care taken to
ensure they have consistent and concise syntax.
\item Fn is designed for a "mostly functional" programming style, where immutability
and referential transparency are favored, but not required.
\item The native macro system allows definition of new syntax (and even entire
domain-specific languages) using regular Fn code and data structures.
\end{itemize}

The syntax looks like this:

\begin{verbatim}
(def sqrt-precision 0.001)
(def approx-sqrt (x)
  (letfn iterate (guess)
    (if (< (abs (- x (* guess guess)) sqrt-precision))
        guess
        (iterate (/ (+ guess (/ x guess) 2)))))
  (if (>= x 0)
      (iterate (/ x 2))
      (error "Cannot approximate square root of a negative number.")))
\end{verbatim}


\subsection{Variables and Mutation}
\label{sec:orga508ab5}
