lang-spec.html
<div id="outline-container-org18c59eb" class="outline-4">
<h4 id="org18c59eb"><span class="section-number-4">2.2.1</span> Local Variables</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Local variables can be created using one of the special operators <code>let</code>, <code>letfn</code>, or
<code>with</code>.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> They all bind variables in the same way, but with
different syntax for programmer convenience. Function parameters are also
treated as local variables within the function body.
</p>

<p>
Before proceeding, we note that the full story about local variables involves
variable capture semantics, which are covered in a later section. Variable
capture doesn't affect any of the concepts discussed in the rest of this section.
</p>

<p>
<code>let</code> is the most elementary way to create a local variable. It defines one or
more new variables in the current lexical environment.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; let binds variables to the given values</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">let</span> x <span style="color: #2aa198; font-weight: bold;">'symbol</span><span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">;; multiple definitions can be made in a single let</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">let</span> a 16
     b <span style="color: #7388d6;">(</span>reverse <span style="color: #8b7355;">"string"</span><span style="color: #7388d6;">)</span>
     <span style="color: #586e75; font-style: italic;">;; value expressions can refer to variables from earlier in the same let</span>
     c <span style="color: #7388d6;">(</span>+ a <span style="color: #909183;">(</span>length b<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
</pre>
</div>

<p>
<code>with</code> is similar to <code>let</code>, but rather than creating definitions in the containing
environment, it creates a new lexical environment.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; this creates two variables</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">with</span> <span style="color: #7388d6;">(</span>a 3
       b 4<span style="color: #7388d6;">)</span>
  <span style="color: #586e75; font-style: italic;">;; the body can contain multiple expressions</span>
  <span style="color: #7388d6;">(</span>println <span style="color: #8b7355;">"hello"</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>+ a b<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">;; returns 7</span>
<span style="color: #586e75; font-style: italic;">;; the variables a, b do not exist outside of the with body</span>
</pre>
</div>

<p>
<code>letfn</code> has a streamlined syntax for creating functions, but otherwise behaves
like <code>let</code>. See the documentation below for details.
</p>

<p>
All local variables can have their value changed with <code>set!</code>. The exclamation
point is because mutation is not to be taken lightly. The syntax for <code>set!</code> is
like this:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">set!</span> var-name new-value<span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">;; for example</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">let</span> var <span style="color: #2aa198; font-weight: bold;">'hi</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>println var<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; prints 'hi</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">set!</span> var <span style="color: #2aa198; font-weight: bold;">'lo</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>println var<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; prints 'lo</span>
</pre>
</div>

<p>
Note that attempting to <code>set!</code> a global variable will result in an error.
</p>
</div>
</div>


<div id="outline-container-org6e47629" class="outline-4">
<h4 id="org6e47629"><span class="section-number-4">2.2.2</span> Global Variables</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Global variables in Fn are created using <code>def</code> or <code>defn</code>. E.g.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> my-global <span style="color: #2aa198; font-weight: bold;">'special-constant</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> my-other-global <span style="color: #7388d6;">(</span>+ 21 69<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
<code>defn</code> behaves exactly like <code>def</code>, but has special syntax streamlined for defining
functions.
</p>

<p>
Global variables are immutable, i.e. they cannot be changed by using <code>set!</code>.
However, by assigning global variables to mutable datatypes or by exploiting
variable capture (discussed in a later section), mutable state can still be
associated to a global variable. This is intended behavior, however, it is not
recommended that you abuse it.
</p>
</div>
</div>
</div>


<div id="outline-container-orgcd88626" class="outline-3">
<h3 id="orgcd88626"><span class="section-number-3">2.3</span> Data Types</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Fn provides the following builtin data types (type names in Fn are
<code>Capitalized-Like-This</code>):
</p>

<dl class="org-dl">
<dt><code>Nil</code></dt><dd>The special constant <code>nil</code>, used to indicate no value.</dd>
<dt><code>Bool</code></dt><dd>The special boolean constants <code>true</code> and <code>false</code>.</dd>
<dt><code>Num</code></dt><dd>Floating-point numbers. (These are almost IEEE 64-bit floats, but we
truncate the significand by four bits to fit type information).</dd>
<dt><code>Symbol</code></dt><dd>Internalized strings. These are essentially strings with a faster
equality test, at the expensive of slower access to the characters of the
string. They are used extensively by the macro system.</dd>
<dt><code>String</code></dt><dd>(Immutable) sequences of bytes. Usually these are UTF-8 encoded
character streams.</dd>
<dt><code>List</code></dt><dd>(Immutable) singley-linked lists.</dd>
<dt><code>Table</code></dt><dd>Mutable key-value stores.</dd>
</dl>

<p>
Of these, only lists and tables logically contain other values. (Substrings can
be extracted from strings, but this actually creates a new string object and
just copies in data from the other string). So, we call <code>List</code> and <code>Table</code> the two
<b>compound data types</b>, and call the rest of them <b>simple data types</b>.
</p>
</div>
