lang-spec.tex

\subsubsection{Local Variables}
\label{sec:orgc302283}

Local variables can be created using one of the special operators \texttt{let}, \texttt{letfn}, or
\texttt{with}.\footnote{In Fn, the \texttt{with} operator provides the functionality of what
most Lisp-like languages call \texttt{let}, while Fn's \texttt{let} is quite different, as it acts
on the surrounding environment.} They all bind variables in the same way, but with
different syntax for programmer convenience. Function parameters are also
treated as local variables within the function body.

Before proceeding, we note that the full story about local variables involves
variable capture semantics, which are covered in a later section. Variable
capture doesn't affect any of the concepts discussed in the rest of this section.

\texttt{let} is the most elementary way to create a local variable. It defines one or
more new variables in the current lexical environment.

\begin{verbatim}
;; let binds variables to the given values
(let x 'symbol)
;; multiple definitions can be made in a single let
(let a 16
     b (reverse "string")
     ;; value expressions can refer to variables from earlier in the same let
     c (+ a (length b))
\end{verbatim}

\texttt{with} is similar to \texttt{let}, but rather than creating definitions in the containing
environment, it creates a new lexical environment.

\begin{verbatim}
;; this creates two variables
(with (a 3
       b 4)
  ;; the body can contain multiple expressions
  (println "hello")
  (+ a b))
;; returns 7
;; the variables a, b do not exist outside of the with body
\end{verbatim}

\texttt{letfn} has a streamlined syntax for creating functions, but otherwise behaves
like \texttt{let}. See the documentation below for details.

All local variables can have their value changed with \texttt{set!}. The exclamation
point is because mutation is not to be taken lightly. The syntax for \texttt{set!} is
like this:

\begin{verbatim}
(set! var-name new-value)
;; for example
(let var 'hi)
(println var) ;; prints 'hi
(set! var 'lo)
(println var) ;; prints 'lo
\end{verbatim}

Note that attempting to \texttt{set!} a global variable will result in an error.


\subsubsection{Global Variables}
\label{sec:org25d2c11}

Global variables in Fn are created using \texttt{def} or \texttt{defn}. E.g.

\begin{verbatim}
(def my-global 'special-constant)
(def my-other-global (+ 21 69))
\end{verbatim}

\texttt{defn} behaves exactly like \texttt{def}, but has special syntax streamlined for defining
functions.

Global variables are immutable, i.e. they cannot be changed by using \texttt{set!}.
However, by assigning global variables to mutable datatypes or by exploiting
variable capture (discussed in a later section), mutable state can still be
associated to a global variable. This is intended behavior, however, it is not
recommended that you abuse it.


\subsection{Data Types}
\label{sec:orgd17d65e}

Fn provides the following builtin data types (type names in Fn are
\texttt{Capitalized-Like-This}):

\begin{description}
\item[{\texttt{Nil}}] The special constant \texttt{nil}, used to indicate no value.
\item[{\texttt{Bool}}] The special boolean constants \texttt{true} and \texttt{false}.
\item[{\texttt{Num}}] Floating-point numbers. (These are almost IEEE 64-bit floats, but we
truncate the significand by four bits to fit type information).
\item[{\texttt{Symbol}}] Internalized strings. These are essentially strings with a faster
equality test, at the expensive of slower access to the characters of the
string. They are used extensively by the macro system.
\item[{\texttt{String}}] (Immutable) sequences of bytes. Usually these are UTF-8 encoded
character streams.
\item[{\texttt{List}}] (Immutable) singley-linked lists.
\item[{\texttt{Table}}] Mutable key-value stores.
\end{description}

Of these, only lists and tables logically contain other values. (Substrings can
be extracted from strings, but this actually creates a new string object and
just copies in data from the other string). So, we call \texttt{List} and \texttt{Table} the two
\textbf{compound data types}, and call the rest of them \textbf{simple data types}.
