lang-spec.html

<div id="outline-container-org1d6fd5b" class="outline-4">
<h4 id="org1d6fd5b"><span class="section-number-4">2.3.1</span> Simple Data Types</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Here is what the syntax looks like for the simple data types:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; numbers are pretty much what you'd expect</span>
2
-6
3.14159
2.0e-6 <span style="color: #586e75; font-style: italic;">;; we have scientific notation</span>
0xFf <span style="color: #586e75; font-style: italic;">;; hexadecimal, even!</span>

<span style="color: #586e75; font-style: italic;">;; strings are enclosed within matched double quotes</span>
<span style="color: #8b7355;">"string"</span>
<span style="color: #8b7355;">"Fn uses escape codes from C, e.g. \\ \"\n"</span>
<span style="color: #8b7355;">""</span>

<span style="color: #586e75; font-style: italic;">;; symbols are prefixed by a single quote.</span>
<span style="color: #2aa198; font-weight: bold;">'sym1</span>
<span style="color: #2aa198; font-weight: bold;">'sym2</span>
<span style="color: #586e75; font-style: italic;">;; symbols can contain whitespace and syntax characters, provided they are </span>
<span style="color: #586e75; font-style: italic;">;; escaped with a backslash</span>
<span style="color: #2aa198; font-weight: bold;">'sym\ with\ \"escapes</span>\"
<span style="color: #586e75; font-style: italic;">;; be careful about the quote operator. If the quoted expression is a number,</span>
<span style="color: #586e75; font-style: italic;">;; it will result in a number instead of a symbol. You can get around this </span>
<span style="color: #586e75; font-style: italic;">;; with escapes:</span>
<span style="color: #2aa198; font-weight: bold;">'0xb8</span>  <span style="color: #586e75; font-style: italic;">;; this is a number</span>
<span style="color: #2aa198; font-weight: bold;">'\0xb8</span> <span style="color: #586e75; font-style: italic;">;; this is a symbol</span>

<span style="color: #586e75; font-style: italic;">;; booleans and nil are called by name</span>
<span style="color: #2aa198; font-weight: bold;">true</span>
<span style="color: #2aa198; font-weight: bold;">false</span>
<span style="color: #2aa198; font-weight: bold;">nil</span>
</pre>
</div>

<p>
See also subsection <a href="#org451b875">2.3.4</a> for more on symbols and the quote operator.
</p>
</div>
</div>


<div id="outline-container-orgdb0d21e" class="outline-4">
<h4 id="orgdb0d21e"><span class="section-number-4">2.3.2</span> Lists</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Lists in Fn are what you'd expect for a functional programming language. They're
created using square brackets or by using the <code>List</code> function.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">[]</span> <span style="color: #586e75; font-style: italic;">; empty list</span>
<span style="color: #707183;">[</span><span style="color: #2aa198; font-weight: bold;">'a</span> <span style="color: #2aa198; font-weight: bold;">'b</span><span style="color: #707183;">]</span> <span style="color: #586e75; font-style: italic;">; list of two symbols</span>
<span style="color: #707183;">[</span>1 <span style="color: #2aa198; font-weight: bold;">'a</span> <span style="color: #8b7355;">"str"</span><span style="color: #707183;">]</span> <span style="color: #586e75; font-style: italic;">; lists may contain objects of arbitrary type</span>

<span style="color: #586e75; font-style: italic;">;; List is identical to square bracket syntax</span>
<span style="color: #707183;">[</span>1 2 3<span style="color: #707183;">]</span>
<span style="color: #707183;">(</span><span style="color: #00688b;">List</span> 1 2 3<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Lists can be manipulated with builtin functions:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> list1 <span style="color: #7388d6;">[</span><span style="color: #909183;">[</span><span style="color: #8b7355;">"str"</span> 2<span style="color: #909183;">]</span> <span style="color: #2aa198; font-weight: bold;">'a</span> <span style="color: #2aa198; font-weight: bold;">'b</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> list2 <span style="color: #7388d6;">[</span>0 2 4 6 8 10<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>

<span style="color: #586e75; font-style: italic;">;; head and tail access the head and tail of the list</span>
<span style="color: #707183;">(</span>head list1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; ["str" 2]</span>
<span style="color: #707183;">(</span>head list2<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 0</span>
<span style="color: #707183;">(</span>tail list1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; ['a 'b]</span>

<span style="color: #707183;">(</span>tail <span style="color: #7388d6;">[]</span><span style="color: #707183;">)</span>    <span style="color: #586e75; font-style: italic;">;=&gt; []</span>
<span style="color: #707183;">(</span>head <span style="color: #7388d6;">[]</span><span style="color: #707183;">)</span>    <span style="color: #586e75; font-style: italic;">;=&gt; error (empty list has no head)</span>

<span style="color: #586e75; font-style: italic;">;; nth allows random access:</span>
<span style="color: #707183;">(</span>nth list1 2<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 'b</span>
<span style="color: #707183;">(</span>nth list2 1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 2</span>

<span style="color: #586e75; font-style: italic;">;; length gives the length of a list</span>
<span style="color: #707183;">(</span>length <span style="color: #7388d6;">[]</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 0</span>
<span style="color: #707183;">(</span>length list1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 3</span>
<span style="color: #707183;">(</span>length list2<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 6</span>

<span style="color: #586e75; font-style: italic;">;; cons prepends elements</span>
<span style="color: #707183;">(</span>cons 2 <span style="color: #7388d6;">[]</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; [2]</span>
<span style="color: #707183;">(</span>cons <span style="color: #2aa198; font-weight: bold;">nil</span> list1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; [nil ["str" 2] 'a 'b]</span>

<span style="color: #586e75; font-style: italic;">;; concat concatenates two or more lists</span>
<span style="color: #707183;">(</span>concat <span style="color: #7388d6;">[</span>1 2 3<span style="color: #7388d6;">]</span> <span style="color: #7388d6;">[</span>4 5 6<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; [1 2 3 4 5 6]</span>
<span style="color: #707183;">(</span>concat <span style="color: #7388d6;">[</span>37<span style="color: #7388d6;">]</span> <span style="color: #7388d6;">[</span><span style="color: #2aa198; font-weight: bold;">'foo</span><span style="color: #7388d6;">]</span> <span style="color: #7388d6;">[</span><span style="color: #8b7355;">"bar"</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; [37 'foo "bar"]</span>
<span style="color: #707183;">(</span>concat list2 list1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; [0 2 4 6 8 10 ["str" 2] 'a 'b]</span>

<span style="color: #586e75; font-style: italic;">;; reverse reverse the direction of a list</span>
<span style="color: #707183;">(</span>reverse list2<span style="color: #707183;">)</span> =&gt; <span style="color: #707183;">[</span>10 8 6 4 2 0<span style="color: #707183;">]</span>
</pre>
</div>
</div>
</div>
