lang-spec.html


<div id="outline-container-org04383f0" class="outline-4">
<h4 id="org04383f0"><span class="section-number-4">2.3.3</span> <span class="todo TODO">TODO</span> Tables</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Tables are key-value stores. Any type of object may be used as a key or a value,
(note, however, that it takes longer to hash more complicated data structures
since we have to descend on their fields)<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
Tables are built using braces <code>{}</code> or the equivalent <code>Table</code> function. This must be
passed an even number of arguments.
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">{}</span> <span style="color: #586e75; font-style: italic;">;=&gt; empty table</span>
<span style="color: #707183;">{</span><span style="color: #2aa198; font-weight: bold;">'key1</span> 4 <span style="color: #2aa198; font-weight: bold;">'key</span> 6<span style="color: #707183;">}</span> <span style="color: #586e75; font-style: italic;">;=&gt; table with two kv-pairs</span>
<span style="color: #707183;">(</span><span style="color: #00688b;">Table</span> <span style="color: #2aa198; font-weight: bold;">'key1</span> 4 <span style="color: #2aa198; font-weight: bold;">'key</span> 6<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; table with two kv-pairs</span>
</pre>
</div>

<p>
Table elements may be accessed using the builtin function <code>get</code>. When the key is a
constant symbol, dot syntax (or the equivalent <code>dot</code> special operator) can be
used instead. This is how this looks:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> tab1 <span style="color: #7388d6;">{</span><span style="color: #2aa198; font-weight: bold;">'name</span> <span style="color: #8b7355;">"Mr. Table"</span>
          <span style="color: #2aa198; font-weight: bold;">'occupation</span> <span style="color: #8b7355;">"Holds data"</span>
          <span style="color: #2aa198; font-weight: bold;">'child</span> <span style="color: #909183;">{</span><span style="color: #2aa198; font-weight: bold;">'name</span> <span style="color: #8b7355;">"Table Jr."</span> 
                  <span style="color: #2aa198; font-weight: bold;">'occupation</span> <span style="color: #8b7355;">"Holds less data"</span><span style="color: #909183;">}</span><span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> tab2 <span style="color: #7388d6;">{</span>0 <span style="color: #2aa198; font-weight: bold;">'zero</span> 1 <span style="color: #2aa198; font-weight: bold;">'one</span> 2 <span style="color: #2aa198; font-weight: bold;">'two</span> 3 <span style="color: #2aa198; font-weight: bold;">'three</span> 4 <span style="color: #2aa198; font-weight: bold;">'four</span><span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>

<span style="color: #586e75; font-style: italic;">;; these all return "Mr. Table"</span>
<span style="color: #707183;">(</span>get tab1 <span style="color: #2aa198; font-weight: bold;">'name</span><span style="color: #707183;">)</span>
tab1.name
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">dot</span> tab1 name<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; equivalent syntax to the dot expression</span>
<span style="color: #586e75; font-style: italic;">;; Note that the symbols in the dot expressions are unquoted. Arguments to dot </span>
<span style="color: #586e75; font-style: italic;">;; must be unquoted symbols or a compilation error occurs.</span>

<span style="color: #586e75; font-style: italic;">;; get is more flexible than dot and allows arbitrary key and value expressions</span>
<span style="color: #707183;">(</span>get tab2 <span style="color: #7388d6;">(</span>+ 1 2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 'three</span>
<span style="color: #707183;">(</span>get <span style="color: #7388d6;">{</span><span style="color: #2aa198; font-weight: bold;">'k</span> <span style="color: #2aa198; font-weight: bold;">'v</span><span style="color: #7388d6;">}</span> <span style="color: #2aa198; font-weight: bold;">'k</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; 'v</span>

<span style="color: #586e75; font-style: italic;">;; dot makes it convenient to descend on tables with symbolic key names</span>
tab1.child.name <span style="color: #586e75; font-style: italic;">;=&gt; "Table Jr."</span>
<span style="color: #586e75; font-style: italic;">;; equivalent expression:</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">dot</span> tab1 child name<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Since tables are mutable, the main way to populate them is to use the <code>set!</code>
operator (the same one as for local variables). In this case, the first argument
may be any legal <code>get</code> or <code>dot</code> expression on a table.
</p>

<div class="org-src-container">
<pre class="src src-fn">
</pre>
</div>

<p>
Lastly, tables size can be checked with <code>length</code>, a list of keys can be retrieved
with <code>table-keys</code>, and two or more tables can be combined with <code>concat</code> (if any of
the tables have keys in common, the last table in the argument list takes
priority).
</p>
</div>
</div>
