lang-spec.tex


\subsubsection{{\bfseries\sffamily TODO} Tables}
\label{sec:org4014214}

Tables are key-value stores. Any type of object may be used as a key or a value,
(note, however, that it takes longer to hash more complicated data structures
since we have to descend on their fields)\footnote{Two keys are equal if \texttt{(= k1 k2)} is true (using the builtin
equality function). For simple data types the meaning of equality is obvious.
Lists and tables are compared componentwise. That is, two lists are equal if and
only if all their respective entries are equal. Two tables are equal if their
key sets are equal (disregarding order), and for each key the corresponding
values in each table are equal.}.

Tables are built using braces \texttt{\{\}} or the equivalent \texttt{Table} function. This must be
passed an even number of arguments.

\begin{verbatim}
{} ;=> empty table
{'key1 4 'key 6} ;=> table with two kv-pairs
(Table 'key1 4 'key 6) ;=> table with two kv-pairs
\end{verbatim}

Table elements may be accessed using the builtin function \texttt{get}. When the key is a
constant symbol, dot syntax (or the equivalent \texttt{dot} special operator) can be
used instead. This is how this looks:

\begin{verbatim}
(def tab1 {'name "Mr. Table"
          'occupation "Holds data"
          'child {'name "Table Jr." 
                  'occupation "Holds less data"}})
(def tab2 {0 'zero 1 'one 2 'two 3 'three 4 'four})

;; these all return "Mr. Table"
(get tab1 'name)
tab1.name
(dot tab1 name) ; equivalent syntax to the dot expression
;; Note that the symbols in the dot expressions are unquoted. Arguments to dot 
;; must be unquoted symbols or a compilation error occurs.

;; get is more flexible than dot and allows arbitrary key and value expressions
(get tab2 (+ 1 2)) ;=> 'three
(get {'k 'v} 'k) ;=> 'v

;; dot makes it convenient to descend on tables with symbolic key names
tab1.child.name ;=> "Table Jr."
;; equivalent expression:
(dot tab1 child name)
\end{verbatim}

Since tables are mutable, the main way to populate them is to use the \texttt{set!}
operator (the same one as for local variables). In this case, the first argument
may be any legal \texttt{get} or \texttt{dot} expression on a table.

Lastly, tables size can be checked with \texttt{length}, a list of keys can be retrieved
with \texttt{table-keys}, and two or more tables can be combined with \texttt{concat} (if any of
the tables have keys in common, the last table in the argument list takes
priority).
