lang-spec.org
*** Quoting

"Quoting" refers to the process of converting Fn source code into native Fn
data. This allows us to easily process and manipulate Fn source code using the
same facilities as for normal data.

Quoting is the secret sauce that makes Fn's macro system work. It's the main
reason why Fn has the syntax it has.

The ~quote~ special operator has syntax:
#+BEGIN_SRC fn
(quote <expr>) ;; or, equivalently
'<expr>
#+END_SRC
where ~<expr>~ can be any expression (in fact, it need not be a legal expression
by itself). These two notations are exactly the same. The interpreter expands
the second into the first before evaluation.

The value returned by quote is guaranteed to only consist of lists, symbols,
numbers, and strings. We refer to the latter three as *atoms*. Here are some
examples:
#+BEGIN_SRC fn
'(a b c) ;; returns ['a 'b 'c]
'"string" ;; returns "string"
'(+ a (/ x 2)) ;; returns ['+ 'a ['/ 'x 2]]

''quot ;; is equivalent to
(quote (quote quot)) ;; which returns ['quote 'quot]
#+END_SRC

Note that ~<expr>~ only needs to be syntactically valid (i.e. not freak out the
parser). Illegal expressions can be quoted just fine:
#+BEGIN_SRC fn
'() ;; returns [] (the empty list)
'(2 (3 4)) ;; returns [2 [3 4]]
'(quote) ;; returns ['quote]
#+END_SRC

This makes ~quote~ very handy for creating nested lists of atoms. (~quote~ also has
a big sister named ~quasiquote~, which is covered in the section on macros, and
allows for much more flexibility).

~quote~ is also the primary way to create symbols. As noted in subsection [[Simple
Data Types]], this can lead to problems when we want a symbol whose name is a
syntactically valid number. Adding an escape character to the symbol name
designates to the parser that the token should be read as a symbol rather than a
number. In fact, we can even use this trick to give variables numbers for names:
#+BEGIN_SRC fn
;; probably don't do this
(def \2 3)
2  ;; returns 2
\2 ;; returns 3
#+END_SRC

My recommendation: just don't use symbol names that are syntactically legal
numbers.


** Control Flow and Functions

*** Conditional Execution

The conditional control flow primitives are ~if~ and ~cond~.


*** Creating Functions

Functions are created using ~fn~.

A short syntax is also provided for creating functions via the dollar sign,
which expands into a ~dollar-fn~ special form.

For example:
#+BEGIN_SRC fn
(fn (x) (* x x))
$(* $ $)
(dollar-fn (* $ $))
#+END_SRC

All three of the above take in a single argument and square it. Note that
dollar-fn uses ~$~ (or equivalently, ~$0~) for the name of the first parameter.
(Other positional parameters can be accessed with ~$1~, ~$2~, and so on). See
subsection [[dollar-fn]] for more details.

~fn~ on the other hand has an explicit parameter list. The syntax for parameter
lists is this:
#+BEGIN_SRC
param-list      ::=  '(' <req-param>* <opt-param>* <var-params>? ')'
req-param       ::= <identifier>
opt-param       ::= (<identifier> <init-form>)
var-params      ::= <var-list-param> <var-table-param>?
                  | <var-table-param> <var-list-param>?
var-list-param  ::= '&' <identifier>
var-table-param ::= ':&' <identifier>
#+END_SRC

In other words, parameter lists consist of zero or more required parameters,
zero or more optional parameters, and optionally end with variadic table and
list arguments.

Each of these parameters has an associated identifier (i.e. a symbol that is a
legal name). In the function's body, the respective arguments are bound to these
names. See subsection [[Function Calls]] for information about how argument lists
are processed during functino calls.


