lang-spec.html


<div id="outline-container-org451b875" class="outline-4">
<h4 id="org451b875"><span class="section-number-4">2.3.4</span> Quoting</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
"Quoting" refers to the process of converting Fn source code into native Fn
data. This allows us to easily process and manipulate Fn source code using the
same facilities as for normal data.
</p>

<p>
Quoting is the secret sauce that makes Fn's macro system work. It's the main
reason why Fn has the syntax it has.
</p>

<p>
The <code>quote</code> special operator has syntax:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">quote</span> &lt;expr&gt;<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; or, equivalently</span>
<span style="color: #2aa198; font-weight: bold;">'&lt;expr&gt;</span>
</pre>
</div>
<p>
where <code>&lt;expr&gt;</code> can be any expression (in fact, it need not be a legal expression
by itself). These two notations are exactly the same. The interpreter expands
the second into the first before evaluation.
</p>

<p>
The value returned by quote is guaranteed to only consist of lists, symbols,
numbers, and strings. We refer to the latter three as <b>atoms</b>. Here are some
examples:
</p>
<div class="org-src-container">
<pre class="src src-fn">'<span style="color: #707183;">(</span>a b c<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns ['a 'b 'c]</span>
'<span style="color: #8b7355;">"string"</span> <span style="color: #586e75; font-style: italic;">;; returns "string"</span>
'<span style="color: #707183;">(</span>+ a <span style="color: #7388d6;">(</span>/ x 2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns ['+ 'a ['/ 'x 2]]</span>

'<span style="color: #2aa198; font-weight: bold;">'quot</span> <span style="color: #586e75; font-style: italic;">;; is equivalent to</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">quote</span> <span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">quote</span> quot<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; which returns ['quote 'quot]</span>
</pre>
</div>

<p>
Note that <code>&lt;expr&gt;</code> only needs to be syntactically valid (i.e. not freak out the
parser). Illegal expressions can be quoted just fine:
</p>
<div class="org-src-container">
<pre class="src src-fn">'<span style="color: #707183;">()</span> <span style="color: #586e75; font-style: italic;">;; returns [] (the empty list)</span>
'<span style="color: #707183;">(</span>2 <span style="color: #7388d6;">(</span>3 4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns [2 [3 4]]</span>
'<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">quote</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;; returns ['quote]</span>
</pre>
</div>

<p>
This makes <code>quote</code> very handy for creating nested lists of atoms. (<code>quote</code> also has
a big sister named <code>quasiquote</code>, which is covered in the section on macros, and
allows for much more flexibility).
</p>

<p>
<code>quote</code> is also the primary way to create symbols. As noted in subsection <a href="#org1d6fd5b">2.3.1</a>, this can lead to problems when we want a symbol whose name is a
syntactically valid number. Adding an escape character to the symbol name
designates to the parser that the token should be read as a symbol rather than a
number. In fact, we can even use this trick to give variables numbers for names:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; probably don't do this</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> \2 3<span style="color: #707183;">)</span>
2  <span style="color: #586e75; font-style: italic;">;; returns 2</span>
\2 <span style="color: #586e75; font-style: italic;">;; returns 3</span>
</pre>
</div>

<p>
My recommendation: just don't use symbol names that are syntactically legal
numbers.
</p>
</div>
</div>
</div>


<div id="outline-container-org4a08bbb" class="outline-3">
<h3 id="org4a08bbb"><span class="section-number-3">2.4</span> Control Flow and Functions</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orge602e03" class="outline-4">
<h4 id="orge602e03"><span class="section-number-4">2.4.1</span> Conditional Execution</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
The conditional control flow primitives are <code>if</code> and <code>cond</code>.
</p>
</div>
</div>


<div id="outline-container-orgc633385" class="outline-4">
<h4 id="orgc633385"><span class="section-number-4">2.4.2</span> Creating Functions</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Functions are created using <code>fn</code>.
</p>

<p>
A short syntax is also provided for creating functions via the dollar sign,
which expands into a <code>dollar-fn</code> special form.
</p>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">fn</span> <span style="color: #7388d6;">(</span>x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>* x x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #859900; font-weight: bold;">$</span><span style="color: #707183;">(</span>* $ $<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">dollar-fn</span> <span style="color: #7388d6;">(</span>* $ $<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
All three of the above take in a single argument and square it. Note that
dollar-fn uses <code>$</code> (or equivalently, <code>$0</code>) for the name of the first parameter.
(Other positional parameters can be accessed with <code>$1</code>, <code>$2</code>, and so on). See
subsection <a href="#org31a627f">2.4.5</a> for more details.
</p>

<p>
<code>fn</code> on the other hand has an explicit parameter list. The syntax for parameter
lists is this:
</p>
<pre class="example">
param-list      ::=  '(' &lt;req-param&gt;* &lt;opt-param&gt;* &lt;var-params&gt;? ')'
req-param       ::= &lt;identifier&gt;
opt-param       ::= (&lt;identifier&gt; &lt;init-form&gt;)
var-params      ::= &lt;var-list-param&gt; &lt;var-table-param&gt;?
                  | &lt;var-table-param&gt; &lt;var-list-param&gt;?
var-list-param  ::= '&amp;' &lt;identifier&gt;
var-table-param ::= ':&amp;' &lt;identifier&gt;
</pre>

<p>
In other words, parameter lists consist of zero or more required parameters,
zero or more optional parameters, and optionally end with variadic table and
list arguments.
</p>

<p>
Each of these parameters has an associated identifier (i.e. a symbol that is a
legal name). In the function's body, the respective arguments are bound to these
names. See subsection <a href="#orgd535b78">2.4.3</a> for information about how argument lists
are processed during functino calls.
</p>
</div>
</div>
