lang-spec.tex


\subsubsection{Quoting}
\label{sec:orgdf14b97}

"Quoting" refers to the process of converting Fn source code into native Fn
data. This allows us to easily process and manipulate Fn source code using the
same facilities as for normal data.

Quoting is the secret sauce that makes Fn's macro system work. It's the main
reason why Fn has the syntax it has.

The \texttt{quote} special operator has syntax:
\begin{verbatim}
(quote <expr>) ;; or, equivalently
'<expr>
\end{verbatim}
where \texttt{<expr>} can be any expression (in fact, it need not be a legal expression
by itself). These two notations are exactly the same. The interpreter expands
the second into the first before evaluation.

The value returned by quote is guaranteed to only consist of lists, symbols,
numbers, and strings. We refer to the latter three as \textbf{atoms}. Here are some
examples:
\begin{verbatim}
'(a b c) ;; returns ['a 'b 'c]
'"string" ;; returns "string"
'(+ a (/ x 2)) ;; returns ['+ 'a ['/ 'x 2]]

''quot ;; is equivalent to
(quote (quote quot)) ;; which returns ['quote 'quot]
\end{verbatim}

Note that \texttt{<expr>} only needs to be syntactically valid (i.e. not freak out the
parser). Illegal expressions can be quoted just fine:
\begin{verbatim}
'() ;; returns [] (the empty list)
'(2 (3 4)) ;; returns [2 [3 4]]
'(quote) ;; returns ['quote]
\end{verbatim}

This makes \texttt{quote} very handy for creating nested lists of atoms. (\texttt{quote} also has
a big sister named \texttt{quasiquote}, which is covered in the section on macros, and
allows for much more flexibility).

\texttt{quote} is also the primary way to create symbols. As noted in subsection \ref{sec:org10b3e3a}, this can lead to problems when we want a symbol whose name is a
syntactically valid number. Adding an escape character to the symbol name
designates to the parser that the token should be read as a symbol rather than a
number. In fact, we can even use this trick to give variables numbers for names:
\begin{verbatim}
;; probably don't do this
(def \2 3)
2  ;; returns 2
\2 ;; returns 3
\end{verbatim}

My recommendation: just don't use symbol names that are syntactically legal
numbers.


\subsection{{\bfseries\sffamily TODO} Control Flow and Functions}
\label{sec:org67814c5}

\subsubsection{Conditional Execution}
\label{sec:org0a9ff87}

The conditional control flow primitives are \texttt{if} and \texttt{cond}.


\subsubsection{Creating Functions}
\label{sec:org87d2bc1}

Functions are created using \texttt{fn}.

A short syntax is also provided for creating functions via the dollar sign,
which expands into a \texttt{dollar-fn} special form.

For example:
\begin{verbatim}
(fn (x) (* x x))
$(* $ $)
(dollar-fn (* $ $))
\end{verbatim}

All three of the above take in a single argument and square it. Note that
dollar-fn uses \texttt{\$} (or equivalently, \texttt{\$0}) for the name of the first parameter.
(Other positional parameters can be accessed with \texttt{\$1}, \texttt{\$2}, and so on). See
subsection \ref{sec:org975cdcb} for more details.

\texttt{fn} on the other hand has an explicit parameter list. The syntax for parameter
lists is this:
\begin{verbatim}
param-list      ::=  '(' <req-param>* <opt-param>* <var-params>? ')'
req-param       ::= <identifier>
opt-param       ::= (<identifier> <init-form>)
var-params      ::= <var-list-param> <var-table-param>?
                  | <var-table-param> <var-list-param>?
var-list-param  ::= '&' <identifier>
var-table-param ::= ':&' <identifier>
\end{verbatim}

In other words, parameter lists consist of zero or more required parameters,
zero or more optional parameters, and optionally end with variadic table and
list arguments.

Each of these parameters has an associated identifier (i.e. a symbol that is a
legal name). In the function's body, the respective arguments are bound to these
names. See subsection \ref{sec:org8352aea} for information about how argument lists
are processed during functino calls.
