lang-spec.html


<div id="outline-container-orgd535b78" class="outline-4">
<h4 id="orgd535b78"><span class="section-number-4">2.4.3</span> Function Calls</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Fn allows arguments to be named in function calls very similarly to Python.
Named arguments are passed using keywords, which are simply symbols whose names
begin with <code>:</code>. These symbols are not legal identifiers, so their appearance in
function calls is unambiguous. We also place the restriction that positional
arguments may not follow named ones. (Believe me, I tried to make it work
without that, and it's a mess at every level).
</p>

<p>
First we will deal with the case where there are no variadic parameters. See the
following example.
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; this function has 3 positional parameters, the last of which is optional</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #cd9b1d;">arg-demo</span> <span style="color: #7388d6;">(</span>x y <span style="color: #909183;">(</span>z 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>* z <span style="color: #909183;">(</span>+ x y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #586e75; font-style: italic;">;; here are a couple of ways we could call this function</span>
<span style="color: #707183;">(</span>arg-demo 2 3<span style="color: #707183;">)</span>            <span style="color: #586e75; font-style: italic;">; x = 2, y = 3, z = 2, result = 10</span>
<span style="color: #707183;">(</span>arg-demo 2 3 4<span style="color: #707183;">)</span>          <span style="color: #586e75; font-style: italic;">; x = 2, y = 3, z = 4, result = 20</span>
<span style="color: #707183;">(</span>arg-demo <span style="color: #859900;">:x</span> 2 <span style="color: #859900;">:y</span> 3<span style="color: #707183;">)</span>      <span style="color: #586e75; font-style: italic;">; x = 2, y = 3, z = 2, result = 10</span>
<span style="color: #707183;">(</span>arg-demo <span style="color: #859900;">:z</span> 2 <span style="color: #859900;">:y</span> 3 <span style="color: #859900;">:x</span> 2<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; x = 2, y = 3, z = 2, result = 10</span>
<span style="color: #707183;">(</span>arg-demo <span style="color: #859900;">:z</span> 3 1 2<span style="color: #707183;">)</span>       <span style="color: #586e75; font-style: italic;">; error! positional argument following named argument</span>
</pre>
</div>

<p>
To be precise, function parameters (still considering the case where there are
no variadic parameters) are bound using the following procedure:
</p>
<ul class="org-ul">
<li>the unnamed arguments are bound to positional parameters in order</li>
<li>the named arguments are bound to their respective parameters, raising an error
if any duplicates or unrecognized names are found</li>
<li>unbound optional parameters are set to their default values. If any required
parameters remain unbound, an error is raised</li>
</ul>

<p>
Now, variadic arguments change some of the rules. We have two types of variadic
parameters in Fn: variadic tables, and variadic lists.
</p>

<p>
For tables, the semantics are very simple. Functions with a variadic table
parameter can accept any named argument, not just the names corresponding to
their functions (duplicated names are still not allowed). Moreover, it's now
possible for a named argument to have the same name as a positional argument.
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; demo function ignores first arg and returns table</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> var-tab-demo <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>x <span style="color: #2aa198; font-weight: bold;">nil</span><span style="color: #909183;">)</span> <span style="color: #859900;">:&amp;</span> tab<span style="color: #7388d6;">)</span> <span style="color: #586e75; font-style: italic;">; variadic table arguments denoted with :&amp;</span>
  tab<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>var-tab-demo 0<span style="color: #707183;">)</span>         <span style="color: #586e75; font-style: italic;">; result = {}</span>
<span style="color: #707183;">(</span>var-tab-demo <span style="color: #859900;">:y</span> 2 <span style="color: #859900;">:x</span> 1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; result = {'y 1}</span>
<span style="color: #707183;">(</span>var-tab-demo 1 <span style="color: #859900;">:x</span> 2<span style="color: #707183;">)</span>    <span style="color: #586e75; font-style: italic;">; result = {'x 2}</span>
</pre>
</div>

<p>
As can be seen above, the variadic table is constructed by taking all
unrecognized named arguments and inserting them into the table as key-value
pairs. Moreover, if a named argument is recognized, but was already provided as
a positional argument, then that goes to the variadic table as well.
</p>

<p>
Variadic lists are analogous to variadic tables, but where those act on trailing
named arguments, variadic lists act on trailing positional arguments. As such,
it is impossible to use named arguments while at the same time passing a
non-empty variadic list argument, except in the case where there is also a
variadic table parameter to catch the trailing arguments.
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;; demo function ignores first arg and returns list</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> var-lst-demo <span style="color: #7388d6;">(</span>x <span style="color: #859900;">&amp;</span> list<span style="color: #7388d6;">)</span> <span style="color: #586e75; font-style: italic;">; variadic lists denoted with &amp;</span>
  list<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>var-lst-demo 0 1 2<span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">;=&gt; [1 2]</span>
<span style="color: #707183;">(</span>var-lst-demo 0<span style="color: #707183;">)</span>      <span style="color: #586e75; font-style: italic;">;=&gt; []</span>
<span style="color: #707183;">(</span>var-lst-demo 0 <span style="color: #859900;">:x</span> 2<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; syntax error</span>
<span style="color: #707183;">(</span>var-lst-demo <span style="color: #859900;">:x</span> 0<span style="color: #707183;">)</span>   <span style="color: #586e75; font-style: italic;">;=&gt; []</span>
<span style="color: #707183;">(</span>var-lst-demo <span style="color: #859900;">:x</span> 0 1<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; syntax error</span>

<span style="color: #586e75; font-style: italic;">;; demo function using both variadic parameters</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> var-mixed-demo <span style="color: #7388d6;">(</span>x <span style="color: #859900;">&amp;</span> list <span style="color: #859900;">:&amp;</span> table<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">[</span>list table<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>

<span style="color: #586e75; font-style: italic;">;; names not explicitly in the parameter list get sent to the variadic table</span>
<span style="color: #707183;">(</span>var-mixed-demo <span style="color: #859900;">:x</span> 4 <span style="color: #859900;">:y</span> 2<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; [[] {'y 2}]</span>
<span style="color: #586e75; font-style: italic;">;; with a variadic table argument, duplicate names are allowed if one is a </span>
<span style="color: #586e75; font-style: italic;">;; positional arg:</span>
<span style="color: #707183;">(</span>var-mixed-demo <span style="color: #2aa198; font-weight: bold;">'a</span> <span style="color: #2aa198; font-weight: bold;">'b</span> <span style="color: #859900;">:x</span> 4 <span style="color: #859900;">:y</span> 2<span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; [['b] {'x 4 'y 2}]</span>
<span style="color: #586e75; font-style: italic;">;; as always, keywords cannot precede positional arguments</span>
<span style="color: #707183;">(</span>var-mixed-demo <span style="color: #859900;">:x</span> 4 <span style="color: #859900;">:y</span> 2 <span style="color: #2aa198; font-weight: bold;">'a</span> <span style="color: #2aa198; font-weight: bold;">'b</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">;=&gt; syntax error</span>
</pre>
</div>
</div>
</div>
