lang-spec.org
*** Variable Capture


*** dollar-fn

** Namespaces and Import

*** Namespaces and Packages

All code in Fn runs inside some namespace, which is used to hold currently
visible global variables and macros.

A *namespace* is a collection of macro and variable definitions. Namespaces are
identified by a *name*, which is a string not containing any slashes, and a
*package*, which is a string representing a logical collection of namespaces.
Finally, the symbol ~<package>/<name>~ is called the *identifier* or *ID* of the
namespace. This ID is required to be globally unique.

*Examples of Namespace IDs:*
#+BEGIN_SRC fn
fn/builtin              ; package is "fn", name is "builtin"
fn/internal/io          ; package is "fn/internal", name is "io"
my-project/util/linalg  ; package is "my-project/util", name is "linalg"
my-project/model        ; package is "my-project", name is "model"
#+END_SRC

When evaluating code from a file, the namespace name will always be the stem of
the file. The package can be set via a package declaration, see [[Package
Declarations]].

The default REPL namespace is ~fn/interactive~. Fn source code passed in as a
command line argument is also evaluated in this namespace.


*** Import

The ~import~ special form allows definitions from an external namespace to be
copied into the current one. The syntax for import looks like this:

#+BEGIN_SRC fn
(import <namespace-id>)                  ; invocation 1
(import <namespace-id> :as <alias>)      ; invocation 2
(import <namespace-id> :no-prefix true)  ; invocation 3
#+END_SRC

Say we have a namespace ~foo/bar/baz~ containing variables named ~bob~ and
~alice~:
#+BEGIN_SRC fn
;;; baz.fn
(package foo/bar)
(def alice "Alice")
(def bob "Bob")
#+END_SRC

We have three ways to import this namespace, shown above. All three cause the
definitions from ~foo/bar/baz~ to be copied into the current namespace. However,
in each case the created bindings will have different names. The three cases are
illustrated below:

#+BEGIN_SRC fn
;;; main.fn

;; invocation 1
(import foo/bar/baz)
; variables look like this:
baz:alice
baz:bob

;; invocation 2
(import foo/bar/baz :as b)
; variables look like this:
b:alice
b:bob

;; invocation 3
(import foo/bar/baz :no-prefix true)
; variables are imported directly (no colons)
alice
bob
#+END_SRC


*** Package Declarations

The first expression of a file (not counting comments) may be a *package
declaration*. These have the form ~(package <package-name>)~, where <package-name>
is a symbol. This simply sets the package name for the file when it is
interpreted. If no package declaration is present, the package ~fn/user~ is used.

When a file is imported, a warning is generated if its package declaration
disagrees with the package of the import, however the import will still work.


*** Global Names

After a namespace has been imported once, its bindings can be referenced even
without importing it explicitly. This is done by using symbols whose names are
structured like with ~/<namespace>:<symbol>~. For example, ~/fn/builtin:map~
refers to the function ~map~ in the ~fn/builtin~ namespace.


** Macros

*** Macro Basics

*** Quasiquotation

*** Variable Capture and ~gensym~


* Formal Semantics

This section is a formal description of every type of expression in Fn. It is
currently incomplete and inaccurate. I don't know why you'd want to look at it.

#+begin_src
program ::= expr* expr ::= immediate
        | variable
        | special-form
        | function-call
        | macro-call
#+end_src

