lang-spec.html


<div id="outline-container-org45c5c99" class="outline-4">
<h4 id="org45c5c99"><span class="section-number-4">2.4.4</span> Variable Capture</h4>
</div>


<div id="outline-container-org31a627f" class="outline-4">
<h4 id="org31a627f"><span class="section-number-4">2.4.5</span> dollar-fn</h4>
</div>
</div>

<div id="outline-container-org4ef2e1f" class="outline-3">
<h3 id="org4ef2e1f"><span class="section-number-3">2.5</span> Namespaces and Import</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org062af04" class="outline-4">
<h4 id="org062af04"><span class="section-number-4">2.5.1</span> Namespaces and Packages</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
All code in Fn runs inside some namespace, which is used to hold currently
visible global variables and macros.
</p>

<p>
A <b>namespace</b> is a collection of macro and variable definitions. Namespaces are
identified by a <b>name</b>, which is a string not containing any slashes, and a
<b>package</b>, which is a string representing a logical collection of namespaces.
Finally, the symbol <code>&lt;package&gt;/&lt;name&gt;</code> is called the <b>identifier</b> or <b>ID</b> of the
namespace. This ID is required to be globally unique.
</p>

<p>
<b>Examples of Namespace IDs:</b>
</p>
<div class="org-src-container">
<pre class="src src-fn">fn/builtin              <span style="color: #586e75; font-style: italic;">; package is "fn", name is "builtin"</span>
fn/internal/io          <span style="color: #586e75; font-style: italic;">; package is "fn/internal", name is "io"</span>
my-project/util/linalg  <span style="color: #586e75; font-style: italic;">; package is "my-project/util", name is "linalg"</span>
my-project/model        <span style="color: #586e75; font-style: italic;">; package is "my-project", name is "model"</span>
</pre>
</div>

<p>
When evaluating code from a file, the namespace name will always be the stem of
the file. The package can be set via a package declaration, see <a href="#org2d5b6cc">2.5.3</a>.
</p>

<p>
The default REPL namespace is <code>fn/interactive</code>. Fn source code passed in as a
command line argument is also evaluated in this namespace.
</p>
</div>
</div>


<div id="outline-container-orgf8b012b" class="outline-4">
<h4 id="orgf8b012b"><span class="section-number-4">2.5.2</span> Import</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
The <code>import</code> special form allows definitions from an external namespace to be
copied into the current one. The syntax for import looks like this:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> &lt;namespace-id&gt;<span style="color: #707183;">)</span>                  <span style="color: #586e75; font-style: italic;">; invocation 1</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> &lt;namespace-id&gt; <span style="color: #859900;">:as</span> &lt;alias&gt;<span style="color: #707183;">)</span>      <span style="color: #586e75; font-style: italic;">; invocation 2</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> &lt;namespace-id&gt; <span style="color: #859900;">:no-prefix</span> <span style="color: #2aa198; font-weight: bold;">true</span><span style="color: #707183;">)</span>  <span style="color: #586e75; font-style: italic;">; invocation 3</span>
</pre>
</div>

<p>
Say we have a namespace <code>foo/bar/baz</code> containing variables named <code>bob</code> and
<code>alice</code>:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;;; baz.fn</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">package</span> foo/bar<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> alice <span style="color: #8b7355;">"Alice"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> bob <span style="color: #8b7355;">"Bob"</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
We have three ways to import this namespace, shown above. All three cause the
definitions from <code>foo/bar/baz</code> to be copied into the current namespace. However,
in each case the created bindings will have different names. The three cases are
illustrated below:
</p>

<div class="org-src-container">
<pre class="src src-fn"><span style="color: #586e75; font-style: italic;">;;; main.fn</span>

<span style="color: #586e75; font-style: italic;">;; invocation 1</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> foo/bar/baz<span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">; variables look like this:</span>
baz:alice
baz:bob

<span style="color: #586e75; font-style: italic;">;; invocation 2</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> foo/bar/baz <span style="color: #859900;">:as</span> b<span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">; variables look like this:</span>
b:alice
b:bob

<span style="color: #586e75; font-style: italic;">;; invocation 3</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">import</span> foo/bar/baz <span style="color: #859900;">:no-prefix</span> <span style="color: #2aa198; font-weight: bold;">true</span><span style="color: #707183;">)</span>
<span style="color: #586e75; font-style: italic;">; variables are imported directly (no colons)</span>
alice
bob
</pre>
</div>
</div>
</div>


<div id="outline-container-org2d5b6cc" class="outline-4">
<h4 id="org2d5b6cc"><span class="section-number-4">2.5.3</span> Package Declarations</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
The first expression of a file (not counting comments) may be a <b>package
declaration</b>. These have the form <code>(package &lt;package-name&gt;)</code>, where &lt;package-name&gt;
is a symbol. This simply sets the package name for the file when it is
interpreted. If no package declaration is present, the package <code>fn/user</code> is used.
</p>

<p>
When a file is imported, a warning is generated if its package declaration
disagrees with the package of the import, however the import will still work.
</p>
</div>
</div>


<div id="outline-container-orgbeb4a64" class="outline-4">
<h4 id="orgbeb4a64"><span class="section-number-4">2.5.4</span> Global Names</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
After a namespace has been imported once, its bindings can be referenced even
without importing it explicitly. This is done by using symbols whose names are
structured like with <code>/&lt;namespace&gt;:&lt;symbol&gt;</code>. For example, <code>/fn/builtin:map</code>
refers to the function <code>map</code> in the <code>fn/builtin</code> namespace.
</p>
</div>
</div>
</div>


<div id="outline-container-orgc860825" class="outline-3">
<h3 id="orgc860825"><span class="section-number-3">2.6</span> Macros</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org151c9bb" class="outline-4">
<h4 id="org151c9bb"><span class="section-number-4">2.6.1</span> Macro Basics</h4>
</div>

<div id="outline-container-orgedea835" class="outline-4">
<h4 id="orgedea835"><span class="section-number-4">2.6.2</span> Quasiquotation</h4>
</div>

<div id="outline-container-org532fff5" class="outline-4">
<h4 id="org532fff5"><span class="section-number-4">2.6.3</span> Variable Capture and <code>gensym</code></h4>
</div>
</div>
</div>


<div id="outline-container-orgb30bf51" class="outline-2">
<h2 id="orgb30bf51"><span class="section-number-2">3</span> Formal Semantics</h2>
<div class="outline-text-2" id="text-3">
<p>
This section is a formal description of every type of expression in Fn. It is
currently incomplete and inaccurate. I don't know why you'd want to look at it.
</p>

<pre class="example">
program ::= expr* expr ::= immediate
        | variable
        | special-form
        | function-call
        | macro-call
</pre>
</div>
