lang-spec.tex


\subsubsection{Variable Capture}
\label{sec:org9945995}


\subsubsection{dollar-fn}
\label{sec:org975cdcb}

\subsection{{\bfseries\sffamily TODO} Namespaces and Import}
\label{sec:org4b0fe4d}

\subsubsection{Namespaces and Packages}
\label{sec:orgdeda7f2}

All code in Fn runs inside some namespace, which is used to hold currently
visible global variables and macros.

A \textbf{namespace} is a collection of macro and variable definitions. Namespaces are
identified by a \textbf{name}, which is a string not containing any slashes, and a
\textbf{package}, which is a string representing a logical collection of namespaces.
Finally, the symbol \texttt{<package>/<name>} is called the \textbf{identifier} or \textbf{ID} of the
namespace. This ID is required to be globally unique.

\textbf{Examples of Namespace IDs:}
\begin{verbatim}
fn/builtin              ; package is "fn", name is "builtin"
fn/internal/io          ; package is "fn/internal", name is "io"
my-project/util/linalg  ; package is "my-project/util", name is "linalg"
my-project/model        ; package is "my-project", name is "model"
\end{verbatim}

When evaluating code from a file, the namespace name will always be the stem of
the file. The package can be set via a package declaration, see \ref{sec:orgb5d06fc}.

The default REPL namespace is \texttt{fn/interactive}. Fn source code passed in as a
command line argument is also evaluated in this namespace.


\subsubsection{Import}
\label{sec:org85057e2}

The \texttt{import} special form allows definitions from an external namespace to be
copied into the current one. The syntax for import looks like this:

\begin{verbatim}
(import <namespace-id>)                  ; invocation 1
(import <namespace-id> :as <alias>)      ; invocation 2
(import <namespace-id> :no-prefix true)  ; invocation 3
\end{verbatim}

Say we have a namespace \texttt{foo/bar/baz} containing variables named \texttt{bob} and
\texttt{alice}:
\begin{verbatim}
;;; baz.fn
(package foo/bar)
(def alice "Alice")
(def bob "Bob")
\end{verbatim}

We have three ways to import this namespace, shown above. All three cause the
definitions from \texttt{foo/bar/baz} to be copied into the current namespace. However,
in each case the created bindings will have different names. The three cases are
illustrated below:

\begin{verbatim}
;;; main.fn

;; invocation 1
(import foo/bar/baz)
; variables look like this:
baz:alice
baz:bob

;; invocation 2
(import foo/bar/baz :as b)
; variables look like this:
b:alice
b:bob

;; invocation 3
(import foo/bar/baz :no-prefix true)
; variables are imported directly (no colons)
alice
bob
\end{verbatim}


\subsubsection{Package Declarations}
\label{sec:orgb5d06fc}

The first expression of a file (not counting comments) may be a \textbf{package
declaration}. These have the form \texttt{(package <package-name>)}, where <package-name>
is a symbol.


\subsubsection{Global Names}
\label{sec:org3673a57}

After a namespace has been imported once, its bindings can be referenced even
without importing it explicitly. This is done by using symbols whose names are
structured like with \texttt{/<namespace>:<symbol>}. For example, \texttt{/fn/builtin:map}
refers to the function \texttt{map} in the \texttt{fn/builtin} namespace.


\subsection{{\bfseries\sffamily TODO} Macros}
\label{sec:org725e1c4}

\subsubsection{Macro Basics}
\label{sec:org73c1c41}

\subsubsection{Quasiquotation}
\label{sec:orgb06d932}

\subsubsection{Variable Capture and \texttt{gensym}}
\label{sec:orgf78a814}


\section{Formal Semantics}
\label{sec:org24ca7ef}

This section is a formal description of every type of expression in Fn. It is
currently incomplete and inaccurate. I don't know why you'd want to look at it.

\begin{verbatim}
program ::= expr* expr ::= immediate
        | variable
        | special-form
        | function-call
        | macro-call
\end{verbatim}
