lang-spec.org
** Immediate Expressions and Variables

Syntax:
#+begin_src
immediate ::= boolean 
          | nil
          | number
          | string
variable ::= non-special-symbol
#+end_src

An immediate expression is a literal representing a constant value. On
evaluation, immediate expressions immediately return the value they represent.

Variables are represented by non-special symbols, (where special symbols are
those naming special forms, boolean values, or nil). If there exists a binding
in the current environment for the provided symbol, then its value is returned.
Otherwise an exception is raised.


** Special forms

Special forms are so called because they have different semantics than function
or macro calls.

*** and
Syntax:
#+begin_src
and-expr ::= "(" "and" expr* ")"
#+end_src

Expressions are evaluated one at a time until a logically false value is
encountered, then returns ~false~. If the end of the list is reached, returns
~true~.

*** cond
Syntax:
#+begin_src
cond-expr ::= "(" "cond" cond-case+ ")"
cond-case ::= expr expr
#+end_src

For each cond-case, the following is done:
- evaluate the first expression
- if the first expression is logically true, return the value of the second
  expression
- otherwise, proceed to the next cond-case.

If the end of the list is reached, returns ~nil~.
*** def
Syntax:
#+begin_src
def-expr ::= "(" "def" identifier expr ")"
         | "(" "def" func-proto expr+")"
func-proto ::= "(" identifier param-list ")"
#+end_src

Create a (global) binding in the current namespace. The first syntax binds the
identifier to the value of the expression. The second syntax creates a function
with the specified name and parameter list and the expressions as its body. In
either case, if the identifier is already bound, an exception is raised.

Returns ~null~.

*** TODO defmacro
Syntax:
#+begin_src
defmacro-expr ::= "(" "defmacro" identifier param-list expr+ ")"
#+end_src

*** defn
*** do
Syntax:
#+begin_src
do-expr ::= "(" "do" expr* ")"
#+end_src

Evaluates provided expressions one at a time, returning the value of the last
one, or ~null~ if no expressions are given.

*** do-inline
*** TODO dot
Syntax:
#+begin_src
dot-expr ::= dotted-symbol
           | "(" "dot" symbol+ ")"
#+end_src

This operator is usually used with the dotted-symbol syntax, e.g. ~table.key~.

The first symbol (leftmost in the inline notation) must name a variable bound to
a table. The next symbol is used as a key to access an element of the table. If
additional symbols are provided, then they are used as keys to recursively
descend into a tree of tables. An exception is raised if one of the keys is
invalid or if an attempt is made to access an object which is not a table.

*** dollar-fn
Syntax:
#+begin_src
dollar-fn-expr ::= "(" "dollar-fn" expr ")"
               | "$(" expr+ ")"
               | "$[" expr+ "]"
               | "${" expr+ "}"
               | "$`" form
#+end_src

Creates an anonymous function which evaluates the provided expression. With the
"$" syntax, this is the expression after the dollar sign. (The only expressions
which may follow are parenthesized forms, quasiquote forms, or list/table
expressions).

Within the provided expression, variables named ~$N~ where N is a nonnegative
integer, are bound to the corresponding positional parameters starting from 0.
In addition, ~$~ is bound to the first parameter ~$0~ and ~$&~ is used for a
variadic parameter.

The parameter list for the created function accepts as many positional
parameters as the highest value of N and a variadic parameter only if ~$&~
appears in the expression. (This is accomplished by performing code-walking,
including macroexpansion, before compiling the ~dollar-fn~).

*** if
Syntax:
#+begin_src
if-expr ::= "(" "if" test-expr expr expr ")"
test-expr ::= expr
#+end_src

Evaluates test-expr. If the result is logically true, evaluates the second
argument, otherwise evaluates final argument, returning the result.

