lang-spec.html

<div id="outline-container-orge23f878" class="outline-3">
<h3 id="orge23f878"><span class="section-number-3">3.1</span> Immediate Expressions and Variables</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Syntax:
</p>
<pre class="example">
immediate ::= boolean 
          | nil
          | number
          | string
variable ::= non-special-symbol
</pre>

<p>
An immediate expression is a literal representing a constant value. On
evaluation, immediate expressions immediately return the value they represent.
</p>

<p>
Variables are represented by non-special symbols, (where special symbols are
those naming special forms, boolean values, or nil). If there exists a binding
in the current environment for the provided symbol, then its value is returned.
Otherwise an exception is raised.
</p>
</div>
</div>


<div id="outline-container-org608aa34" class="outline-3">
<h3 id="org608aa34"><span class="section-number-3">3.2</span> Special forms</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Special forms are so called because they have different semantics than function
or macro calls.
</p>
</div>

<div id="outline-container-org3063742" class="outline-4">
<h4 id="org3063742"><span class="section-number-4">3.2.1</span> and</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Syntax:
</p>
<pre class="example">
and-expr ::= "(" "and" expr* ")"
</pre>

<p>
Expressions are evaluated one at a time until a logically false value is
encountered, then returns <code>false</code>. If the end of the list is reached, returns
<code>true</code>.
</p>
</div>
</div>

<div id="outline-container-orgcac6e1d" class="outline-4">
<h4 id="orgcac6e1d"><span class="section-number-4">3.2.2</span> cond</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Syntax:
</p>
<pre class="example">
cond-expr ::= "(" "cond" cond-case+ ")"
cond-case ::= expr expr
</pre>

<p>
For each cond-case, the following is done:
</p>
<ul class="org-ul">
<li>evaluate the first expression</li>
<li>if the first expression is logically true, return the value of the second
expression</li>
<li>otherwise, proceed to the next cond-case.</li>
</ul>

<p>
If the end of the list is reached, returns <code>nil</code>.
</p>
</div>
</div>
<div id="outline-container-orgf99f502" class="outline-4">
<h4 id="orgf99f502"><span class="section-number-4">3.2.3</span> def</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Syntax:
</p>
<pre class="example">
def-expr ::= "(" "def" identifier expr ")"
         | "(" "def" func-proto expr+")"
func-proto ::= "(" identifier param-list ")"
</pre>

<p>
Create a (global) binding in the current namespace. The first syntax binds the
identifier to the value of the expression. The second syntax creates a function
with the specified name and parameter list and the expressions as its body. In
either case, if the identifier is already bound, an exception is raised.
</p>

<p>
Returns <code>null</code>.
</p>
</div>
</div>

<div id="outline-container-org25e9743" class="outline-4">
<h4 id="org25e9743"><span class="section-number-4">3.2.4</span> <span class="todo TODO">TODO</span> defmacro</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Syntax:
</p>
<pre class="example">
defmacro-expr ::= "(" "defmacro" identifier param-list expr+ ")"
</pre>
</div>
</div>

<div id="outline-container-orgdf8a17b" class="outline-4">
<h4 id="orgdf8a17b"><span class="section-number-4">3.2.5</span> defn</h4>
</div>
<div id="outline-container-org5753480" class="outline-4">
<h4 id="org5753480"><span class="section-number-4">3.2.6</span> do</h4>
<div class="outline-text-4" id="text-3-2-6">
<p>
Syntax:
</p>
<pre class="example">
do-expr ::= "(" "do" expr* ")"
</pre>

<p>
Evaluates provided expressions one at a time, returning the value of the last
one, or <code>null</code> if no expressions are given.
</p>
</div>
</div>

<div id="outline-container-org7055cb6" class="outline-4">
<h4 id="org7055cb6"><span class="section-number-4">3.2.7</span> do-inline</h4>
</div>
<div id="outline-container-org9c49533" class="outline-4">
<h4 id="org9c49533"><span class="section-number-4">3.2.8</span> <span class="todo TODO">TODO</span> dot</h4>
<div class="outline-text-4" id="text-3-2-8">
<p>
Syntax:
</p>
<pre class="example">
dot-expr ::= dotted-symbol
           | "(" "dot" symbol+ ")"
</pre>

<p>
This operator is usually used with the dotted-symbol syntax, e.g. <code>table.key</code>.
</p>

<p>
The first symbol (leftmost in the inline notation) must name a variable bound to
a table. The next symbol is used as a key to access an element of the table. If
additional symbols are provided, then they are used as keys to recursively
descend into a tree of tables. An exception is raised if one of the keys is
invalid or if an attempt is made to access an object which is not a table.
</p>
</div>
</div>

<div id="outline-container-org0539cf2" class="outline-4">
<h4 id="org0539cf2"><span class="section-number-4">3.2.9</span> dollar-fn</h4>
<div class="outline-text-4" id="text-3-2-9">
<p>
Syntax:
</p>
<pre class="example">
dollar-fn-expr ::= "(" "dollar-fn" expr ")"
               | "$(" expr+ ")"
               | "$[" expr+ "]"
               | "${" expr+ "}"
               | "$`" form
</pre>

<p>
Creates an anonymous function which evaluates the provided expression. With the
"$" syntax, this is the expression after the dollar sign. (The only expressions
which may follow are parenthesized forms, quasiquote forms, or list/table
expressions).
</p>

<p>
Within the provided expression, variables named <code>$N</code> where N is a nonnegative
integer, are bound to the corresponding positional parameters starting from 0.
In addition, <code>$</code> is bound to the first parameter <code>$0</code> and <code>$&amp;</code> is used for a
variadic parameter.
</p>

<p>
The parameter list for the created function accepts as many positional
parameters as the highest value of N and a variadic parameter only if <code>$&amp;</code>
appears in the expression. (This is accomplished by performing code-walking,
including macroexpansion, before compiling the <code>dollar-fn</code>).
</p>
</div>
</div>

<div id="outline-container-orge3165a1" class="outline-4">
<h4 id="orge3165a1"><span class="section-number-4">3.2.10</span> if</h4>
<div class="outline-text-4" id="text-3-2-10">
<p>
Syntax:
</p>
<pre class="example">
if-expr ::= "(" "if" test-expr expr expr ")"
test-expr ::= expr
</pre>

<p>
Evaluates test-expr. If the result is logically true, evaluates the second
argument, otherwise evaluates final argument, returning the result.
</p>
</div>
</div>
