lang-spec.tex

\subsection{Immediate Expressions and Variables}
\label{sec:org66b2d79}

Syntax:
\begin{verbatim}
immediate ::= boolean 
          | nil
          | number
          | string
variable ::= non-special-symbol
\end{verbatim}

An immediate expression is a literal representing a constant value. On
evaluation, immediate expressions immediately return the value they represent.

Variables are represented by non-special symbols, (where special symbols are
those naming special forms, boolean values, or nil). If there exists a binding
in the current environment for the provided symbol, then its value is returned.
Otherwise an exception is raised.


\subsection{Special forms}
\label{sec:orgccc45ce}

Special forms are so called because they have different semantics than function
or macro calls.

\subsubsection{and}
\label{sec:orgc6e15b7}
Syntax:
\begin{verbatim}
and-expr ::= "(" "and" expr* ")"
\end{verbatim}

Expressions are evaluated one at a time until a logically false value is
encountered, then returns \texttt{false}. If the end of the list is reached, returns
\texttt{true}.

\subsubsection{cond}
\label{sec:orgcf965a5}
Syntax:
\begin{verbatim}
cond-expr ::= "(" "cond" cond-case+ ")"
cond-case ::= expr expr
\end{verbatim}

For each cond-case, the following is done:
\begin{itemize}
\item evaluate the first expression
\item if the first expression is logically true, return the value of the second
expression
\item otherwise, proceed to the next cond-case.
\end{itemize}

If the end of the list is reached, returns \texttt{nil}.
\subsubsection{def}
\label{sec:orgd2a8583}
Syntax:
\begin{verbatim}
def-expr ::= "(" "def" identifier expr ")"
         | "(" "def" func-proto expr+")"
func-proto ::= "(" identifier param-list ")"
\end{verbatim}

Create a (global) binding in the current namespace. The first syntax binds the
identifier to the value of the expression. The second syntax creates a function
with the specified name and parameter list and the expressions as its body. In
either case, if the identifier is already bound, an exception is raised.

Returns \texttt{null}.

\subsubsection{{\bfseries\sffamily TODO} defmacro}
\label{sec:orgcbb20c2}
Syntax:
\begin{verbatim}
defmacro-expr ::= "(" "defmacro" identifier param-list expr+ ")"
\end{verbatim}

\subsubsection{defn}
\label{sec:org7c526d7}
\subsubsection{do}
\label{sec:org04e81c1}
Syntax:
\begin{verbatim}
do-expr ::= "(" "do" expr* ")"
\end{verbatim}

Evaluates provided expressions one at a time, returning the value of the last
one, or \texttt{null} if no expressions are given.

\subsubsection{do-inline}
\label{sec:orga9c498c}
\subsubsection{{\bfseries\sffamily TODO} dot}
\label{sec:orgd4f17ad}
Syntax:
\begin{verbatim}
dot-expr ::= dotted-symbol
           | "(" "dot" symbol+ ")"
\end{verbatim}

This operator is usually used with the dotted-symbol syntax, e.g. \texttt{table.key}.

The first symbol (leftmost in the inline notation) must name a variable bound to
a table. The next symbol is used as a key to access an element of the table. If
additional symbols are provided, then they are used as keys to recursively
descend into a tree of tables. An exception is raised if one of the keys is
invalid or if an attempt is made to access an object which is not a table.

\subsubsection{dollar-fn}
\label{sec:org6e1a6d5}
Syntax:
\begin{verbatim}
dollar-fn-expr ::= "(" "dollar-fn" expr ")"
               | "$(" expr+ ")"
               | "$[" expr+ "]"
               | "${" expr+ "}"
               | "$`" form
\end{verbatim}

Creates an anonymous function which evaluates the provided expression. With the
"\$" syntax, this is the expression after the dollar sign. (The only expressions
which may follow are parenthesized forms, quasiquote forms, or list/table
expressions).

Within the provided expression, variables named \texttt{\$N} where N is a nonnegative
integer, are bound to the corresponding positional parameters starting from 0.
In addition, \texttt{\$} is bound to the first parameter \texttt{\$0} and \texttt{\$\&} is used for a
variadic parameter.

The parameter list for the created function accepts as many positional
parameters as the highest value of N and a variadic parameter only if \texttt{\$\&}
appears in the expression. (This is accomplished by performing code-walking,
including macroexpansion, before compiling the \texttt{dollar-fn}).

\subsubsection{if}
\label{sec:org4e4e8bd}
Syntax:
\begin{verbatim}
if-expr ::= "(" "if" test-expr expr expr ")"
test-expr ::= expr
\end{verbatim}

Evaluates test-expr. If the result is logically true, evaluates the second
argument, otherwise evaluates final argument, returning the result.
