lang-spec.html

<div id="outline-container-orge4abed7" class="outline-4">
<h4 id="orge4abed7"><span class="section-number-4">3.2.11</span> <span class="todo TODO">TODO</span> import</h4>
<div class="outline-text-4" id="text-3-2-11">
<p>
Syntax:
</p>
<pre class="example">
import-expr ::= "(" "import" import-designator
                             [:as identifier] ")"
import-designator ::= string | symbol
</pre>

<p>
Import bindings from another namespace. Every variable and macro definition from
the target namespace is copied into the current namespace. The newly created
bindings have names of the form <code>namespace-name:variable-name</code>. Since it is
illegal to create variables whose names contain the colon character, this
ensures that no name collisions can occur, provided there is not already a
namespace imported with this name.
</p>

<p>
If an identifier is provided via the <code>:as</code> argument, then that is used instead of
the namespace name.
</p>

<p>
When <code>import</code> is used on a namespace that is not already loaded, the interpreter
checks for appropriate files in the search path, then compiles and loads them as
necessary.
</p>
</div>

<ol class="org-ol">
<li><a id="org7a089f2"></a>Future changes<br />
<div class="outline-text-5" id="text-3-2-11-1">
<ul class="org-ul">
<li>Support for unqualified imports will be added (i.e. imports without the <code>namespace~name:</code>
prefix).</li>
<li>Import may be changed so as to not recursively import imports from the package
named. With current behavior, we could get names like <code>ns1:ns2:function</code> when
<code>ns1</code> imports <code>ns2</code>. This is mostly harmless, but we'd rather not overclutter
namespaces if only for memory concerns. Also, it could definitely cause
trouble if used with unqualified imports.</li>
<li>Along with unqualified imports, we may add the notion of exports to
namespaces, so that only certain bindings in a namespace are even made
available to external namespaces. This is probably good for convenience for
users of a library, but it also can give implementors some peace of mind
knowing that their internal functions won't be called directly by user code.</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org3036346" class="outline-4">
<h4 id="org3036346"><span class="section-number-4">3.2.12</span> fn</h4>
<div class="outline-text-4" id="text-3-2-12">
<p>
Syntax:
</p>
<pre class="example">
fn-expr ::= "(" "fn" "(" param-list ")" expr+ ")"
</pre>

<p>
Creates a function object using the provided parameter list and function body.
</p>

<p>
Functions have full variable capture semantics. Among other things, this means
that captured variables are shared among functions, so that if one function
mutates the variable, this change is reflected in the other functions accessing
the variable.
</p>
</div>
</div>

<div id="outline-container-orga4a4e6b" class="outline-4">
<h4 id="orga4a4e6b"><span class="section-number-4">3.2.13</span> let</h4>
<div class="outline-text-4" id="text-3-2-13">
<p>
Syntax:
</p>
<pre class="example">
let-expr ::= "(" "let" let-pair+ ")"
let-pair ::= identifier expr
</pre>

<p>
Extends the current local environment. For each let-pair initially binds the
provided identifier to null. Then, in the order provided, each expression is
evaluated and the binding is updated to the resultant value.
</p>

<p>
The initial null-binding allows definition of recursive and even mutually
recursive functions. Care must be taken because this null binding will shadow
existing variables with the same name.
</p>

<p>
Returns null.
</p>
</div>
</div>

<div id="outline-container-org8946817" class="outline-4">
<h4 id="org8946817"><span class="section-number-4">3.2.14</span> <span class="todo TODO">TODO</span> letfn</h4>
</div>
<div id="outline-container-orgbf6d702" class="outline-4">
<h4 id="orgbf6d702"><span class="section-number-4">3.2.15</span> or</h4>
<div class="outline-text-4" id="text-3-2-15">
<p>
Syntax:
</p>
<pre class="example">
or-expr ::= "(" "or" expr* ")"
</pre>

<p>
Evaluates provided expressions one at a time until a logically true value is
obtained. Then returns <code>true</code>. If the end of the list is reached, returns <code>false</code>.
</p>
</div>
</div>

<div id="outline-container-orgd17dcee" class="outline-4">
<h4 id="orgd17dcee"><span class="section-number-4">3.2.16</span> quasiquote</h4>
<div class="outline-text-4" id="text-3-2-16">
<p>
Syntax:
</p>
<pre class="example">
quasiquote-expr ::= "`" form
                | "(" "quasiquote" form ")"
</pre>

<p>
First, creates a fn object corresponding to form just like quote. Before
returning the form, the following transformation is done:
</p>
<ul class="org-ul">
<li>The form is walked like a tree.</li>
<li>When an unquote-expr is encountered, instead of descending into it, evaluate
its argument and insert the result into the tree at that point.</li>
<li>When an unquote-splicing form is encountered, instead of descending into it,
evaluate its argument. If the result is not a list or if this is root of the
tree, raise an error. Otherwise, splice the elements of the list inline into
the tree at this point.</li>
<li>Along the way, we keep track of all symbols whose names begin with a hash
character "#". For each unique hash symbol, a single gensym is created, and
the hash symbols are replaced by the gensyms in the final expansion. For
example, see the following code snippet:</li>
</ul>
<pre class="example">
`(#sym1 #sym2 #sym2) ; is the same as
(with (sym1 (gensym)
       sym2 (gensym))
 [sym1 sym2 sym2])
</pre>
<p>
Note that #-symbols have lexical scope, i.e. they are shared by quasiquote forms
occurring within the outer form.
</p>

<p>
IMPLNOTE: the semantics of #-symbols may be too complicated for what they get
us. Might be better to just make the developer deal with <code>gensym</code> directly, or to
make #-symbols a feature of defmacro.
</p>
</div>
</div>

<div id="outline-container-orgbc161c5" class="outline-4">
<h4 id="orgbc161c5"><span class="section-number-4">3.2.17</span> quote</h4>
<div class="outline-text-4" id="text-3-2-17">
<p>
Syntax:
</p>
<pre class="example">
quote-expr ::= "'" form
           | "(" "quote" form ")"
</pre>

<p>
Returns the syntactic form as an fn object (a tree of atoms and lists).
</p>
</div>
</div>
