lang-spec.tex

\subsubsection{{\bfseries\sffamily TODO} import}
\label{sec:org4dec73f}
Syntax:
\begin{verbatim}
import-expr ::= "(" "import" import-designator
                             [:as identifier] ")"
import-designator ::= string | symbol
\end{verbatim}

Import bindings from another namespace. Every variable and macro definition from
the target namespace is copied into the current namespace. The newly created
bindings have names of the form \texttt{namespace-name:variable-name}. Since it is
illegal to create variables whose names contain the colon character, this
ensures that no name collisions can occur, provided there is not already a
namespace imported with this name.

If an identifier is provided via the \texttt{:as} argument, then that is used instead of
the namespace name.

When \texttt{import} is used on a namespace that is not already loaded, the interpreter
checks for appropriate files in the search path, then compiles and loads them as
necessary.

\begin{enumerate}
\item Future changes
\label{sec:org670e3b5}

\begin{itemize}
\item Support for unqualified imports will be added (i.e. imports without the \texttt{namespace\textasciitilde{}name:}
prefix).
\item Import may be changed so as to not recursively import imports from the package
named. With current behavior, we could get names like \texttt{ns1:ns2:function} when
\texttt{ns1} imports \texttt{ns2}. This is mostly harmless, but we'd rather not overclutter
namespaces if only for memory concerns. Also, it could definitely cause
trouble if used with unqualified imports.
\item Along with unqualified imports, we may add the notion of exports to
namespaces, so that only certain bindings in a namespace are even made
available to external namespaces. This is probably good for convenience for
users of a library, but it also can give implementors some peace of mind
knowing that their internal functions won't be called directly by user code.
\end{itemize}
\end{enumerate}

\subsubsection{fn}
\label{sec:org0edb310}
Syntax:
\begin{verbatim}
fn-expr ::= "(" "fn" "(" param-list ")" expr+ ")"
\end{verbatim}

Creates a function object using the provided parameter list and function body.

Functions have full variable capture semantics. Among other things, this means
that captured variables are shared among functions, so that if one function
mutates the variable, this change is reflected in the other functions accessing
the variable.

\subsubsection{let}
\label{sec:org86dee5a}
Syntax:
\begin{verbatim}
let-expr ::= "(" "let" let-pair+ ")"
let-pair ::= identifier expr
\end{verbatim}

Extends the current local environment. For each let-pair initially binds the
provided identifier to null. Then, in the order provided, each expression is
evaluated and the binding is updated to the resultant value.

The initial null-binding allows definition of recursive and even mutually
recursive functions. Care must be taken because this null binding will shadow
existing variables with the same name.

Returns null.

\subsubsection{{\bfseries\sffamily TODO} letfn}
\label{sec:orgc57dccf}
\subsubsection{or}
\label{sec:org94bce3a}
Syntax:
\begin{verbatim}
or-expr ::= "(" "or" expr* ")"
\end{verbatim}

Evaluates provided expressions one at a time until a logically true value is
obtained. Then returns \texttt{true}. If the end of the list is reached, returns \texttt{false}.

\subsubsection{quasiquote}
\label{sec:orgf21b880}
Syntax:
\begin{verbatim}
quasiquote-expr ::= "`" form
                | "(" "quasiquote" form ")"
\end{verbatim}

First, creates a fn object corresponding to form just like quote. Before
returning the form, the following transformation is done:
\begin{itemize}
\item The form is walked like a tree.
\item When an unquote-expr is encountered, instead of descending into it, evaluate
its argument and insert the result into the tree at that point.
\item When an unquote-splicing form is encountered, instead of descending into it,
evaluate its argument. If the result is not a list or if this is root of the
tree, raise an error. Otherwise, splice the elements of the list inline into
the tree at this point.
\item Along the way, we keep track of all symbols whose names begin with a hash
character "\#". For each unique hash symbol, a single gensym is created, and
the hash symbols are replaced by the gensyms in the final expansion. For
example, see the following code snippet:
\end{itemize}
\begin{verbatim}
`(#sym1 #sym2 #sym2) ; is the same as
(with (sym1 (gensym)
       sym2 (gensym))
 [sym1 sym2 sym2])
\end{verbatim}
Note that \#-symbols have lexical scope, i.e. they are shared by quasiquote forms
occurring within the outer form.

IMPLNOTE: the semantics of \#-symbols may be too complicated for what they get
us. Might be better to just make the developer deal with \texttt{gensym} directly, or to
make \#-symbols a feature of defmacro.

\subsubsection{quote}
\label{sec:orgcd4124b}
Syntax:
\begin{verbatim}
quote-expr ::= "'" form
           | "(" "quote" form ")"
\end{verbatim}

Returns the syntactic form as an fn object (a tree of atoms and lists).
