lang-spec.org
*** unquote
Syntax:
#+begin_src
unquote-expr ::= "," expr
             | "(" "unquote" expr ")"
#+end_src
Emits an error unless encountered within a quasiquote form.

*** unquote-splicing
Syntax:
#+begin_src
unquote-splicing-expr ::= ",@" expr | "(" "unquote-splicing" expr ")"
#+end_src
Emits an error unless encountered within a quasiquote form.

*** TODO set!
Syntax:
#+begin_src
set!-form ::= "(" "set!" place expr ")"
place ::= identifier 
      | dot-expr
      | get-form
get-form ::= "(" "get" expr+ ")"
#+end_src

*** with
Syntax:
#+begin_src
with-expr ::= "(" with-bindings expr+ ")"
with-bindings ::= "(" (id expr)* ")"
#+end_src

Behaves like ~let~, but rather than operating on the enclosing lexical
environment, instead creates a new child environment and adds bindings to that,
then evaluates the provided expressions in the newly created environment.

Note that this is how ~let~ works in most LISP-like languages.


** Function Calls

Syntax:
#+begin_src
function-call ::= "(" func argument-list ")"
#+end_src
where ~func~ may be any expression other than a reserved symbol.

First, the function and then all the arguments are evaluated from left to right.

Arguments are bound to parameters as follows:

Positional arguments are bound to the function's parameters in the order
provided. If there are more positional arguments than parameters, a list of the
extras are bound to the variadic list parameter if one exists. If not, an error
is generated.

After this, keyword arguments are bound to parameters by name. If two keyword
arguments have the same name, an error is raised. If the name isn't one of the
function's parameters, or if it names a parameter already provided by a
positional argument, it is added to the variadic table parameter if one exists.
If not, an error is raised.

If any parameters without default values remain unbound, an error is raised.

Then, the function is called. Foreign functions have behavior determined by the
external code they call. Ordinary functions work by switching back to the
lexical environment in which they were created, binding parameters as local
variables, and executing the function body.


** Macro Calls

Syntax:
#+begin_src
macro-call ::= "(" macro-name form* ")"
macro-name ::= identifier | dot-expr
#+end_src

The expressions for macro arguments aren't evaluated, but are converted to data
and passed to the macro function as arguments. The resultant value is treated as
code and evaluated.

In order to prevent ambiguity, macros do not recognize keyword arguments. A
keyword will be passed to the macro as a positional argument containing the
keyword symbol.


* Lexical Analysis

The component which processes Fn source into lexical tokens is called the
*scanner*. Conceptually, we put in a sequence of bytes and get back a sequence
of tokens.

Tokens are dividide into two groups: fixed width and variable width. The fixed
width tokens are:
- '(' :: left paren
- ')' :: right paren
- '[' :: left bracket
- ']' :: right bracket
- '{' :: left brace
- '}' :: right brace
- '\'' :: quote
- '`' :: backtick
- ',@' :: comma at
- ',' :: comma
- '$`' :: dollar backtick
- '$(' :: dollar paren
- '$[' :: dollar bracket
- '${' :: dollar brace

Fixed width tokens are generated when the scanner encounters one of the
corresponding quoted strings above.

Variable width tokens are:
- <number> :: numeric literal
- <string> :: string literal
- <symbol> :: symbol
- <dot> :: dot expression (2 or more symbols separated by '.')

** Comments

A comments begins with the unescaped character ~';'~ and end at the end of the
line.

Comments are skipped over without generating a token.

