lang-spec.html

<div id="outline-container-org1eec86f" class="outline-4">
<h4 id="org1eec86f"><span class="section-number-4">3.2.18</span> unquote</h4>
<div class="outline-text-4" id="text-3-2-18">
<p>
Syntax:
</p>
<pre class="example">
unquote-expr ::= "," expr
             | "(" "unquote" expr ")"
</pre>
<p>
Emits an error unless encountered within a quasiquote form.
</p>
</div>
</div>

<div id="outline-container-orgc406618" class="outline-4">
<h4 id="orgc406618"><span class="section-number-4">3.2.19</span> unquote-splicing</h4>
<div class="outline-text-4" id="text-3-2-19">
<p>
Syntax:
</p>
<pre class="example">
unquote-splicing-expr ::= ",@" expr | "(" "unquote-splicing" expr ")"
</pre>
<p>
Emits an error unless encountered within a quasiquote form.
</p>
</div>
</div>

<div id="outline-container-org19d854f" class="outline-4">
<h4 id="org19d854f"><span class="section-number-4">3.2.20</span> <span class="todo TODO">TODO</span> set!</h4>
<div class="outline-text-4" id="text-3-2-20">
<p>
Syntax:
</p>
<pre class="example">
set!-form ::= "(" "set!" place expr ")"
place ::= identifier 
      | dot-expr
      | get-form
get-form ::= "(" "get" expr+ ")"
</pre>
</div>
</div>

<div id="outline-container-org4b2ad70" class="outline-4">
<h4 id="org4b2ad70"><span class="section-number-4">3.2.21</span> with</h4>
<div class="outline-text-4" id="text-3-2-21">
<p>
Syntax:
</p>
<pre class="example">
with-expr ::= "(" with-bindings expr+ ")"
with-bindings ::= "(" (id expr)* ")"
</pre>

<p>
Behaves like <code>let</code>, but rather than operating on the enclosing lexical
environment, instead creates a new child environment and adds bindings to that,
then evaluates the provided expressions in the newly created environment.
</p>

<p>
Note that this is how <code>let</code> works in most LISP-like languages.
</p>
</div>
</div>
</div>


<div id="outline-container-orgf351f4e" class="outline-3">
<h3 id="orgf351f4e"><span class="section-number-3">3.3</span> Function Calls</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Syntax:
</p>
<pre class="example">
function-call ::= "(" func argument-list ")"
</pre>
<p>
where <code>func</code> may be any expression other than a reserved symbol.
</p>

<p>
First, the function and then all the arguments are evaluated from left to right.
</p>

<p>
Arguments are bound to parameters as follows:
</p>

<p>
Positional arguments are bound to the function's parameters in the order
provided. If there are more positional arguments than parameters, a list of the
extras are bound to the variadic list parameter if one exists. If not, an error
is generated.
</p>

<p>
After this, keyword arguments are bound to parameters by name. If two keyword
arguments have the same name, an error is raised. If the name isn't one of the
function's parameters, or if it names a parameter already provided by a
positional argument, it is added to the variadic table parameter if one exists.
If not, an error is raised.
</p>

<p>
If any parameters without default values remain unbound, an error is raised.
</p>

<p>
Then, the function is called. Foreign functions have behavior determined by the
external code they call. Ordinary functions work by switching back to the
lexical environment in which they were created, binding parameters as local
variables, and executing the function body.
</p>
</div>
</div>


<div id="outline-container-org6ec37a6" class="outline-3">
<h3 id="org6ec37a6"><span class="section-number-3">3.4</span> Macro Calls</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Syntax:
</p>
<pre class="example">
macro-call ::= "(" macro-name form* ")"
macro-name ::= identifier | dot-expr
</pre>

<p>
The expressions for macro arguments aren't evaluated, but are converted to data
and passed to the macro function as arguments. The resultant value is treated as
code and evaluated.
</p>

<p>
In order to prevent ambiguity, macros do not recognize keyword arguments. A
keyword will be passed to the macro as a positional argument containing the
keyword symbol.
</p>
</div>
</div>
</div>


<div id="outline-container-orgc6efc1f" class="outline-2">
<h2 id="orgc6efc1f"><span class="section-number-2">4</span> Lexical Analysis</h2>
<div class="outline-text-2" id="text-4">
<p>
The component which processes Fn source into lexical tokens is called the
<b>scanner</b>. Conceptually, we put in a sequence of bytes and get back a sequence
of tokens.
</p>

<p>
Tokens are dividide into two groups: fixed width and variable width. The fixed
width tokens are:
</p>
<dl class="org-dl">
<dt>'('</dt><dd>left paren</dd>
<dt>')'</dt><dd>right paren</dd>
<dt>'['</dt><dd>left bracket</dd>
<dt>']'</dt><dd>right bracket</dd>
<dt>'{'</dt><dd>left brace</dd>
<dt>'}'</dt><dd>right brace</dd>
<dt>'\''</dt><dd>quote</dd>
<dt>'`'</dt><dd>backtick</dd>
<dt>',@'</dt><dd>comma at</dd>
<dt>','</dt><dd>comma</dd>
<dt>'$`'</dt><dd>dollar backtick</dd>
<dt>'$('</dt><dd>dollar paren</dd>
<dt>'$['</dt><dd>dollar bracket</dd>
<dt>'${'</dt><dd>dollar brace</dd>
</dl>

<p>
Fixed width tokens are generated when the scanner encounters one of the
corresponding quoted strings above.
</p>

<p>
Variable width tokens are:
</p>
<dl class="org-dl">
<dt>&lt;number&gt;</dt><dd>numeric literal</dd>
<dt>&lt;string&gt;</dt><dd>string literal</dd>
<dt>&lt;symbol&gt;</dt><dd>symbol</dd>
<dt>&lt;dot&gt;</dt><dd>dot expression (2 or more symbols separated by '.')</dd>
</dl>
</div>

<div id="outline-container-org66f1f76" class="outline-3">
<h3 id="org66f1f76"><span class="section-number-3">4.1</span> Comments</h3>
<div class="outline-text-3" id="text-4-1">
<p>
A comments begins with the unescaped character <code>';'</code> and end at the end of the
line.
</p>

<p>
Comments are skipped over without generating a token.
</p>
</div>
</div>
