lang-spec.tex

\subsubsection{unquote}
\label{sec:orgfe08fb0}
Syntax:
\begin{verbatim}
unquote-expr ::= "," expr
             | "(" "unquote" expr ")"
\end{verbatim}
Emits an error unless encountered within a quasiquote form.

\subsubsection{unquote-splicing}
\label{sec:org3e26911}
Syntax:
\begin{verbatim}
unquote-splicing-expr ::= ",@" expr | "(" "unquote-splicing" expr ")"
\end{verbatim}
Emits an error unless encountered within a quasiquote form.

\subsubsection{{\bfseries\sffamily TODO} set!}
\label{sec:orgdce4a8b}
Syntax:
\begin{verbatim}
set!-form ::= "(" "set!" place expr ")"
place ::= identifier 
      | dot-expr
      | get-form
get-form ::= "(" "get" expr+ ")"
\end{verbatim}

\subsubsection{with}
\label{sec:org3b2c38d}
Syntax:
\begin{verbatim}
with-expr ::= "(" with-bindings expr+ ")"
with-bindings ::= "(" (id expr)* ")"
\end{verbatim}

Behaves like \texttt{let}, but rather than operating on the enclosing lexical
environment, instead creates a new child environment and adds bindings to that,
then evaluates the provided expressions in the newly created environment.

Note that this is how \texttt{let} works in most LISP-like languages.


\subsection{Function Calls}
\label{sec:orgb336eed}

Syntax:
\begin{verbatim}
function-call ::= "(" func argument-list ")"
\end{verbatim}
where \texttt{func} may be any expression other than a reserved symbol.

First, the function and then all the arguments are evaluated from left to right.

Arguments are bound to parameters as follows:

Positional arguments are bound to the function's parameters in the order
provided. If there are more positional arguments than parameters, a list of the
extras are bound to the variadic list parameter if one exists. If not, an error
is generated.

After this, keyword arguments are bound to parameters by name. If two keyword
arguments have the same name, an error is raised. If the name isn't one of the
function's parameters, or if it names a parameter already provided by a
positional argument, it is added to the variadic table parameter if one exists.
If not, an error is raised.

If any parameters without default values remain unbound, an error is raised.

Then, the function is called. Foreign functions have behavior determined by the
external code they call. Ordinary functions work by switching back to the
lexical environment in which they were created, binding parameters as local
variables, and executing the function body.


\subsection{Macro Calls}
\label{sec:orga472829}

Syntax:
\begin{verbatim}
macro-call ::= "(" macro-name form* ")"
macro-name ::= identifier | dot-expr
\end{verbatim}

The expressions for macro arguments aren't evaluated, but are converted to data
and passed to the macro function as arguments. The resultant value is treated as
code and evaluated.

In order to prevent ambiguity, macros do not recognize keyword arguments. A
keyword will be passed to the macro as a positional argument containing the
keyword symbol.


\section{Lexical Analysis}
\label{sec:orgaaae3dc}

The component which processes Fn source into lexical tokens is called the
\textbf{scanner}. Conceptually, we put in a sequence of bytes and get back a sequence
of tokens.

Tokens are dividide into two groups: fixed width and variable width. The fixed
width tokens are:
\begin{description}
\item[{'('}] left paren
\item[{')'}] right paren
\item[{'['}] left bracket
\item[{']'}] right bracket
\item[{'\{'}] left brace
\item[{'\}'}] right brace
\item[{'$\backslash$''}] quote
\item[{'`'}] backtick
\item[{',@'}] comma at
\item[{','}] comma
\item[{'\$`'}] dollar backtick
\item[{'\$('}] dollar paren
\item[{'\$['}] dollar bracket
\item[{'\$\{'}] dollar brace
\end{description}

Fixed width tokens are generated when the scanner encounters one of the
corresponding quoted strings above.

Variable width tokens are:
\begin{description}
\item[{<number>}] numeric literal
\item[{<string>}] string literal
\item[{<symbol>}] symbol
\item[{<dot>}] dot expression (2 or more symbols separated by '.')
\end{description}

\subsection{Comments}
\label{sec:org08d4324}

A comments begins with the unescaped character \texttt{';'} and end at the end of the
line.

Comments are skipped over without generating a token.
