lang-spec.html

<div id="outline-container-org99398bb" class="outline-3">
<h3 id="org99398bb"><span class="section-number-3">4.2</span> Numbers, Symbols, and Dots</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Numbers are defined according to regular expressions as in the following
pseudo-BNF grammar:
</p>

<pre class="example">
&lt;number&gt; ::= "[+-]?(&lt;dec&gt;|&lt;hex&gt;)"
&lt;dec&gt;    ::= "[0-9]+\.?&lt;exp&gt;?"
           | "[0-9]*\.[0-9]+&lt;exp&gt;?"
&lt;exp&gt;    ::= "[eE][+-]?[0-9]+"
&lt;hex&gt;    ::= "0[Xx][0-9A-Fa-f]+\.?"
           | "0[Xx][0-9A-Fa-f]*\.[0-9A-Fa-f]"
</pre>

<p>
A symbol is defined to be a sequence of symbol characters and escaped characters
which is not a number. Symbol characters are all printable ASCII characters
other than whitespace or those contained in the string <code>";(){}[]\"\\'`,."</code>. An
escaped character is a sequence of two characters, the escape <code>'\\'</code> followed by
an arbitrary character. When the symbol is internalized, the escape character is
ignored, so its name will contain only the second character of the escape
sequence.
</p>

<p>
If an escape character is followed by EOF, a scanning error is raised.
</p>

<p>
Note that by injecting an escape character, one may cause numbers to be treated
as symbols. Adding an escape in front of any normal character normally no
effect, but in this case, it causes the number reader to fail, so the number's
characters will read as a symbol.
</p>

<p>
Finally, a dot token is a symbol token which contains the dot character <code>'.'</code>,
subject to some additional restrictions. Dots can not occur in the first or last
position of the string, and it can not contain successive dots. In addition, the
substring before the first dot may not be a syntactically valid number. If any
of these conditions is violated, a scanning error is raised.
</p>
</div>
</div>

<div id="outline-container-org9dd3ecd" class="outline-3">
<h3 id="org9dd3ecd"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> String Literals</h3>
<div class="outline-text-3" id="text-4-3">
<p>
String scanning starts when the scanner encounters the (unescaped) character
<code>'"'</code> and ends when it encounters an unescaped <code>'"'</code>. Along the way, all bytes
encountered are read verbatim, except for the escape character '\\', which is
followed by an escape sequence. The entire escape sequence is read into the
string according to the following table <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>:
</p>
<dl class="org-dl">
<dt>'\''</dt><dd>single quote</dd>
<dt>'\"'</dt><dd>double quote</dd>
<dt>'\?'</dt><dd>question mark</dd>
<dt>'\a'</dt><dd>ASCII bell</dd>
<dt>'\b'</dt><dd>backspace</dd>
<dt>'\f'</dt><dd>form feed</dd>
<dt>'\n'</dt><dd>newline</dd>
<dt>'\r'</dt><dd>ASCII carriage return</dd>
<dt>'\t'</dt><dd>tab</dd>
<dt>'\v'</dt><dd>vertical tab</dd>
<dt>'\NNN' (NNN is a 1- to 3- digit octal number)</dt><dd>byte NNN (octal)</dd>
<dt>'\xNN' (NN any two-digit hex number)</dt><dd>the byte NN (hexadecimal)</dd>
<dt>'\uC' (C any 4-digit hex unicode code point)</dt><dd>unicode code point (2 bytes)</dd>
<dt>'\UC' (C any 8-digit hex unicode code point)</dt><dd>unicode code point (4 bytes)</dd>
</dl>
</div>
</div>

<div id="outline-container-org9a0c5da" class="outline-3">
<h3 id="org9a0c5da"><span class="section-number-3">4.4</span> Source Encoding</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Currently, Fn only supports ASCII encoded text files. Behavior on other/extended
encodings is undefined. In the future, Fn will be extended so that UTF-8
characters can appear in strings and symbols.
</p>
</div>
</div>
</div>


<div id="outline-container-org172b6f0" class="outline-2">
<h2 id="org172b6f0"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Built-in Functions</h2>
<div class="outline-text-2" id="text-5">
<p>
Fn provides a number of built-in functions in the namespace <code>fn.builtin</code>.
Whenever a new namespace is created, it automatically inherits all the bindings
from <code>fn.builtin</code>, so these bindings are always available as global variables.
</p>

<p>
Builtin functions are split into primitive and nonprimitive functions. This
classification is not overly rigorous, but the rule is that primitive functions
expose core language functionality which cannot be used any other way. On the
other hand, all nonprimitive functions could theoretically be implemented in Fn
source code by using the primitives.
</p>
</div>
