lang-spec.tex

\subsection{Numbers, Symbols, and Dots}
\label{sec:org4232e10}

Numbers are defined according to regular expressions as in the following
pseudo-BNF grammar:

\begin{verbatim}
<number> ::= "[+-]?(<dec>|<hex>)"
<dec>    ::= "[0-9]+\.?<exp>?"
           | "[0-9]*\.[0-9]+<exp>?"
<exp>    ::= "[eE][+-]?[0-9]+"
<hex>    ::= "0[Xx][0-9A-Fa-f]+\.?"
           | "0[Xx][0-9A-Fa-f]*\.[0-9A-Fa-f]"
\end{verbatim}

A symbol is defined to be a sequence of symbol characters and escaped characters
which is not a number. Symbol characters are all printable ASCII characters
other than whitespace or those contained in the string \texttt{";()\{\}[]\textbackslash{}"\textbackslash{}\textbackslash{}'`,."}. An
escaped character is a sequence of two characters, the escape \texttt{'\textbackslash{}\textbackslash{}'} followed by
an arbitrary character. When the symbol is internalized, the escape character is
ignored, so its name will contain only the second character of the escape
sequence.

If an escape character is followed by EOF, a scanning error is raised.

Note that by injecting an escape character, one may cause numbers to be treated
as symbols. Adding an escape in front of any normal character normally no
effect, but in this case, it causes the number reader to fail, so the number's
characters will read as a symbol.

Finally, a dot token is a symbol token which contains the dot character \texttt{'.'},
subject to some additional restrictions. Dots can not occur in the first or last
position of the string, and it can not contain successive dots. In addition, the
substring before the first dot may not be a syntactically valid number. If any
of these conditions is violated, a scanning error is raised.

\subsection{{\bfseries\sffamily TODO} String Literals}
\label{sec:org01888e7}

String scanning starts when the scanner encounters the (unescaped) character
\texttt{'"'} and ends when it encounters an unescaped \texttt{'"'}. Along the way, all bytes
encountered are read verbatim, except for the escape character '$\backslash$\', which is
followed by an escape sequence. The entire escape sequence is read into the
string according to the following table \footnote{These string escapes are mainly the same as the ones in C.}:
\begin{description}
\item[{'$\backslash$''}] single quote
\item[{'$\backslash$"'}] double quote
\item[{'$\backslash$?'}] question mark
\item[{'\a'}] ASCII bell
\item[{'\b'}] backspace
\item[{'\f'}] form feed
\item[{'\n'}] newline
\item[{'\r'}] ASCII carriage return
\item[{'\t'}] tab
\item[{'\v'}] vertical tab
\item[{'\NNN' (NNN is a 1- to 3- digit octal number)}] byte NNN (octal)
\item[{'\xNN' (NN any two-digit hex number)}] the byte NN (hexadecimal)
\item[{'\uC' (C any 4-digit hex unicode code point)}] unicode code point (2 bytes)
\item[{'\UC' (C any 8-digit hex unicode code point)}] unicode code point (4 bytes)
\end{description}

\subsection{Source Encoding}
\label{sec:org523c108}

Currently, Fn only supports ASCII encoded text files. Behavior on other/extended
encodings is undefined. In the future, Fn will be extended so that UTF-8
characters can appear in strings and symbols.


\section{{\bfseries\sffamily TODO} Built-in Functions}
\label{sec:org9c50f32}

Fn provides a number of built-in functions in the namespace \texttt{fn.builtin}.
Whenever a new namespace is created, it automatically inherits all the bindings
from \texttt{fn.builtin}, so these bindings are always available as global variables.

Builtin functions are split into primitive and nonprimitive functions. This
classification is not overly rigorous, but the rule is that primitive functions
expose core language functionality which cannot be used any other way. On the
other hand, all nonprimitive functions could theoretically be implemented in Fn
source code by using the primitives.
