lang-spec.org
** Primitive Functions

- apply (obj arg0 arg1 & args) :: Call obj as a function. Positional arguments
  for the call are generated by taking a list of all but the last two arguments
  (to apply), and concatenating that with the second-to-last argument, which
  must be a list. The last argument (to apply) is a table of keyword arguments.

- gensym () :: Generate a symbol with a guaranteed unique id. This is used for
  macro writing.
- symbol-name (x) :: get the name of a symbol as a string

- length (obj) :: Depending on the type of obj, returns
  - the length of a string in bytes,
  - the number of elements in a list, or
  - the number of keys in a table or namespace.
- concat (seq0 & seqs) :: Concatenate strings or lists. All the arguments must
  be of the same type.
- nth (n seq) :: Get the nth element of a list or string. If seq is a string the
  result will be a string of length 1 containing the (n-1)th byte of the string.

- = :: check for equality
- same? :: check for equality
- not :: logical not


Type Checkers:

- bool? ::
- function? ::
- int? ::
- list? ::
- namespace? ::
- number? ::
- null? ::
- string? ::
- symbol? ::
- table? ::

Lists and Strings:
- List (& objs) :: Create a list of the given objects
- empty? (obj) :: Equivalent to ~(= obj [])~.
- cons (hd tl) :: Create a new list by prepending hd to tl.
- head (list) :: get the first element of a list. Error on empty.
- tail (list) :: drop the first element of a list. Returns empty on empty.

Tables and Namespaces:
- Table (& kv-pairs) :: Create a table. The argument list is a sequence
  of pairs consisting of keys followed by values.
- get (key obj) :: access a field from a table or namespace
- get-keys (obj) :: get a list of keys from a table or namespace
- has-key? (obj key) :: get a list of keys from a table or namespace

Arithmetic:
- + ::
- - ::
- * ::
- / ::
- ** ::
- < ::
- > ::
- <= ::
- >= ::
- floor ::
- ceil ::

** Nonprimitive functions

(Note: a user type can implement any or all of these functions by adding methods
for them. Sorry, that isn't documented yet).

All of these are non-destructive.

- has-key? (table)

- concat (& seqs)
- reverse (seq)

- insert (elt n seq)
- append (elt seq)
- prepend (elt seq)
- sort (seq (ascending true))
- sort-by (fun seq (ascending true))

- head (seq)
- tail (seq)
- nth (n seq)

- take (test seq)
- drop (test seq)
- take-while (test seq)
- drop-while (test seq)
- split-at (n seq)
- split-when (test seq)

- group (n seq)
- group-by (key seq)
- subseq (start end seq)

- dedup (seq) [remove duplicates]
- replace (n elt seq)

- empty? (seq)
- contains? (seq)

- length< (seq n) [compare lengths w/o nec. computing the thing]
- length> (seq n)
- length<= (seq n)
- length>= (seq n)

- map (fun seq0 & seqs)
- fold (fun init seq0 & seqs)
- filter (test seq)
- every? (test seq)
- any? (test seq)




* Future Extensions

The version of Fn described in this document is version 0.1. The language *will*
change before version 1.0. In particular, I have to, *have to*, add pattern
matching.

Items marked with (Proposed) below are things that might not make it into the
final language.

** Pattern Destructuring in ~def~ and ~let~

Once pattern matching is added to Fn, ~let~ and ~def~ will be able to do
automatic destructuring on the pattern to bind variables. For instance,
#+BEGIN_SRC fn
(def [x y] [1 2])
#+END_SRC
binds ~x~ to ~1~ and ~y~ to ~2~.

When matching fails, an error will be raised.


