lang-spec.html

<div id="outline-container-orge46892f" class="outline-3">
<h3 id="orge46892f"><span class="section-number-3">5.1</span> Primitive Functions</h3>
<div class="outline-text-3" id="text-5-1">
<dl class="org-dl">
<dt>apply (obj arg0 arg1 &amp; args)</dt><dd>Call obj as a function. Positional arguments
for the call are generated by taking a list of all but the last two arguments
(to apply), and concatenating that with the second-to-last argument, which
must be a list. The last argument (to apply) is a table of keyword arguments.</dd>

<dt>gensym ()</dt><dd>Generate a symbol with a guaranteed unique id. This is used for
macro writing.</dd>
<dt>symbol-name (x)</dt><dd>get the name of a symbol as a string</dd>

<dt>length (obj)</dt><dd>Depending on the type of obj, returns
<ul class="org-ul">
<li>the length of a string in bytes,</li>
<li>the number of elements in a list, or</li>
<li>the number of keys in a table or namespace.</li>
</ul></dd>
<dt>concat (seq0 &amp; seqs)</dt><dd>Concatenate strings or lists. All the arguments must
be of the same type.</dd>
<dt>nth (n seq)</dt><dd>Get the nth element of a list or string. If seq is a string the
result will be a string of length 1 containing the (n-1)th byte of the string.</dd>

<dt>=</dt><dd>check for equality</dd>
<dt>same?</dt><dd>check for equality</dd>
<dt>not</dt><dd>logical not</dd>
</dl>


<p>
Type Checkers:
</p>

<dl class="org-dl">
<dt>bool?</dt><dd></dd>

<dt>function?</dt><dd></dd>

<dt>int?</dt><dd></dd>

<dt>list?</dt><dd></dd>

<dt>namespace?</dt><dd></dd>

<dt>number?</dt><dd></dd>

<dt>null?</dt><dd></dd>

<dt>string?</dt><dd></dd>

<dt>symbol?</dt><dd></dd>

<dt>table?</dt><dd></dd>
</dl>

<p>
Lists and Strings:
</p>
<dl class="org-dl">
<dt>List (&amp; objs)</dt><dd>Create a list of the given objects</dd>
<dt>empty? (obj)</dt><dd>Equivalent to <code>(= obj [])</code>.</dd>
<dt>cons (hd tl)</dt><dd>Create a new list by prepending hd to tl.</dd>
<dt>head (list)</dt><dd>get the first element of a list. Error on empty.</dd>
<dt>tail (list)</dt><dd>drop the first element of a list. Returns empty on empty.</dd>
</dl>

<p>
Tables and Namespaces:
</p>
<dl class="org-dl">
<dt>Table (&amp; kv-pairs)</dt><dd>Create a table. The argument list is a sequence
of pairs consisting of keys followed by values.</dd>
<dt>get (key obj)</dt><dd>access a field from a table or namespace</dd>
<dt>get-keys (obj)</dt><dd>get a list of keys from a table or namespace</dd>
<dt>has-key? (obj key)</dt><dd>get a list of keys from a table or namespace</dd>
</dl>

<p>
Arithmetic:
</p>
<dl class="org-dl">
<dt>+</dt><dd></dd>

<dt>-</dt><dd></dd>

<dt>*</dt><dd></dd>

<dt>/</dt><dd></dd>

<dt>**</dt><dd></dd>

<dt>&lt;</dt><dd></dd>

<dt>&gt;</dt><dd></dd>

<dt>&lt;=</dt><dd></dd>

<dt>&gt;=</dt><dd></dd>

<dt>floor</dt><dd></dd>

<dt>ceil</dt><dd></dd>
</dl>
</div>
</div>

<div id="outline-container-org8fec1f1" class="outline-3">
<h3 id="org8fec1f1"><span class="section-number-3">5.2</span> Nonprimitive functions</h3>
<div class="outline-text-3" id="text-5-2">
<p>
(Note: a user type can implement any or all of these functions by adding methods
for them. Sorry, that isn't documented yet).
</p>

<p>
All of these are non-destructive.
</p>

<ul class="org-ul">
<li>has-key? (table)</li>

<li>concat (&amp; seqs)</li>
<li>reverse (seq)</li>

<li>insert (elt n seq)</li>
<li>append (elt seq)</li>
<li>prepend (elt seq)</li>
<li>sort (seq (ascending true))</li>
<li>sort-by (fun seq (ascending true))</li>

<li>head (seq)</li>
<li>tail (seq)</li>
<li>nth (n seq)</li>

<li>take (test seq)</li>
<li>drop (test seq)</li>
<li>take-while (test seq)</li>
<li>drop-while (test seq)</li>
<li>split-at (n seq)</li>
<li>split-when (test seq)</li>

<li>group (n seq)</li>
<li>group-by (key seq)</li>
<li>subseq (start end seq)</li>

<li>dedup (seq) [remove duplicates]</li>
<li>replace (n elt seq)</li>

<li>empty? (seq)</li>
<li>contains? (seq)</li>

<li>length&lt; (seq n) [compare lengths w/o nec. computing the thing]</li>
<li>length&gt; (seq n)</li>
<li>length&lt;= (seq n)</li>
<li>length&gt;= (seq n)</li>

<li>map (fun seq0 &amp; seqs)</li>
<li>fold (fun init seq0 &amp; seqs)</li>
<li>filter (test seq)</li>
<li>every? (test seq)</li>
<li>any? (test seq)</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgd3cff92" class="outline-2">
<h2 id="orgd3cff92"><span class="section-number-2">6</span> Future Extensions</h2>
<div class="outline-text-2" id="text-6">
<p>
The version of Fn described in this document is version 0.1. The language <b>will</b>
change before version 1.0. In particular, I have to, <b>have to</b>, add pattern
matching.
</p>

<p>
Items marked with (Proposed) below are things that might not make it into the
final language.
</p>
</div>

<div id="outline-container-org48649ef" class="outline-3">
<h3 id="org48649ef"><span class="section-number-3">6.1</span> Pattern Destructuring in <code>def</code> and <code>let</code></h3>
<div class="outline-text-3" id="text-6-1">
<p>
Once pattern matching is added to Fn, <code>let</code> and <code>def</code> will be able to do
automatic destructuring on the pattern to bind variables. For instance,
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #7388d6;">[</span>x y<span style="color: #7388d6;">]</span> <span style="color: #7388d6;">[</span>1 2<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
binds <code>x</code> to <code>1</code> and <code>y</code> to <code>2</code>.
</p>

<p>
When matching fails, an error will be raised.
</p>
</div>
</div>
