lang-spec.tex

\subsection{Primitive Functions}
\label{sec:org4e804c2}

\begin{description}
\item[{apply (obj arg0 arg1 \& args)}] Call obj as a function. Positional arguments
for the call are generated by taking a list of all but the last two arguments
(to apply), and concatenating that with the second-to-last argument, which
must be a list. The last argument (to apply) is a table of keyword arguments.

\item[{gensym ()}] Generate a symbol with a guaranteed unique id. This is used for
macro writing.
\item[{symbol-name (x)}] get the name of a symbol as a string

\item[{length (obj)}] Depending on the type of obj, returns
\begin{itemize}
\item the length of a string in bytes,
\item the number of elements in a list, or
\item the number of keys in a table or namespace.
\end{itemize}
\item[{concat (seq0 \& seqs)}] Concatenate strings or lists. All the arguments must
be of the same type.
\item[{nth (n seq)}] Get the nth element of a list or string. If seq is a string the
result will be a string of length 1 containing the (n-1)th byte of the string.

\item[{=}] check for equality
\item[{same?}] check for equality
\item[{not}] logical not
\end{description}


Type Checkers:

\begin{description}
\item[{bool?}] 

\item[{function?}] 

\item[{int?}] 

\item[{list?}] 

\item[{namespace?}] 

\item[{number?}] 

\item[{null?}] 

\item[{string?}] 

\item[{symbol?}] 

\item[{table?}] 
\end{description}

Lists and Strings:
\begin{description}
\item[{List (\& objs)}] Create a list of the given objects
\item[{empty? (obj)}] Equivalent to \texttt{(= obj [])}.
\item[{cons (hd tl)}] Create a new list by prepending hd to tl.
\item[{head (list)}] get the first element of a list. Error on empty.
\item[{tail (list)}] drop the first element of a list. Returns empty on empty.
\end{description}

Tables and Namespaces:
\begin{description}
\item[{Table (\& kv-pairs)}] Create a table. The argument list is a sequence
of pairs consisting of keys followed by values.
\item[{get (key obj)}] access a field from a table or namespace
\item[{get-keys (obj)}] get a list of keys from a table or namespace
\item[{has-key? (obj key)}] get a list of keys from a table or namespace
\end{description}

Arithmetic:
\begin{description}
\item[{+}] 

\item[{-}] 

\item[{*}] 

\item[{/}] 

\item[{**}] 

\item[{<}] 

\item[{>}] 

\item[{<=}] 

\item[{>=}] 

\item[{floor}] 

\item[{ceil}] 
\end{description}

\subsection{Nonprimitive functions}
\label{sec:orgf3599f1}

(Note: a user type can implement any or all of these functions by adding methods
for them. Sorry, that isn't documented yet).

All of these are non-destructive.

\begin{itemize}
\item has-key? (table)

\item concat (\& seqs)
\item reverse (seq)

\item insert (elt n seq)
\item append (elt seq)
\item prepend (elt seq)
\item sort (seq (ascending true))
\item sort-by (fun seq (ascending true))

\item head (seq)
\item tail (seq)
\item nth (n seq)

\item take (test seq)
\item drop (test seq)
\item take-while (test seq)
\item drop-while (test seq)
\item split-at (n seq)
\item split-when (test seq)

\item group (n seq)
\item group-by (key seq)
\item subseq (start end seq)

\item dedup (seq) [remove duplicates]
\item replace (n elt seq)

\item empty? (seq)
\item contains? (seq)

\item length< (seq n) [compare lengths w/o nec. computing the thing]
\item length> (seq n)
\item length<= (seq n)
\item length>= (seq n)

\item map (fun seq0 \& seqs)
\item fold (fun init seq0 \& seqs)
\item filter (test seq)
\item every? (test seq)
\item any? (test seq)
\end{itemize}




\section{Future Extensions}
\label{sec:org72dcd46}

The version of Fn described in this document is version 0.1. The language \textbf{will}
change before version 1.0. In particular, I have to, \textbf{have to}, add pattern
matching.

Items marked with (Proposed) below are things that might not make it into the
final language.

\subsection{Pattern Destructuring in \texttt{def} and \texttt{let}}
\label{sec:orgb8d083e}

Once pattern matching is added to Fn, \texttt{let} and \texttt{def} will be able to do
automatic destructuring on the pattern to bind variables. For instance,
\begin{verbatim}
(def [x y] [1 2])
\end{verbatim}
binds \texttt{x} to \texttt{1} and \texttt{y} to \texttt{2}.

When matching fails, an error will be raised.
