lang-spec.org
** (Proposed) ~#~-Syntax for Collections

So, we turn ~#~ into a syntax character and give ~#()~, ~#[]~, ~#{}~, etc. syntactic
meanings.

There are a couple of options for how to do this:
- ~#()~ could expand to ~(values)~ (if we implement multiple values as proposed), or
  to a set or tuple type.
- ~${}~ could expand to ~(Set)~ or ~(Vector)~, or if we add typed tables, ~#{type ...}~
  could be used to construct types (e.g. ~(construct type ...)~).
- ~#[]~ could expand to ~(Vector)~ or ~(values)~.
- Alternatively, if we lean into lazy data structures, then the ~#~ structures
  could be the respective lazy equivalents

I'm most likely to set ~#[]~ to ~(Vector ...)~. Using ~#{}~ for ~(Set ...)~ would also
make sense, but if typed tables get added, those will be more important for
sets. If multiple values get added, then the ~#()~ syntax should really be used
for that.

Drawbacks: this would make hash into a special character as opposed to just a
symbol constituent.


** Global Names for Definitions

A global variable name consists of a forward slash, the full namespace name, a
colon, and an identifier in that namespace, in that order. For example:
#+BEGIN_SRC fn
/fn/builtin:+
#+END_SRC
is the global name for the builtin ~+~ function.

This is implemented as follows:
- make it illegal to name namespaces beginning with a slash
- make it illegal to create variables whose names contain colons.
  (Alternatively, can make it illegal to create variables whose names start with
  a slash).
- variable names that have this syntax are evaluated a little differently

To get the global name of a symbol, we'll provide a builtin function called
~global-name~, e.g. ~(global-name '+)~ is ~'/fn/builtin:+~.


** (Proposed) ~,:~-Syntax for Global Names in Quasiquote

The syntax ~,:var~ expands ~(unquote (global-name 'var))~. This will be necessary
for all non-builtin functions included in macro expansions, (and should be used
for builtin functions too).


** (Proposed) Multiple Return Values

Idk, these are useful in Matlab and Haskell has this sort of thing going on with
its tuples.

So we create a multiple values object with ~(values x y ...)~. These objects are
tricky; as soon as they get used they collapse to a single value (in this case
the result of expression ~x~).

However, when a multiple values object is returned to a ~let~ or ~def~, then we can
use destructuring to access the additional values. For example:
#+BEGIN_SRC fn
(defn my-fun () (values 1 2 3))
(def x (my-fun)) ; sets x = 1
(def (values y z) ; sets y = 1, z = 2
(def (values y z w) ; sets y = 1, z = 2, w = 3
#+END_SRC

Together with #-syntax for values, this might be a very useful feature. It would
look like this:
#+BEGIN_SRC fn
(def #(y z) (my-fun)) ; sets y = 1, z = 2
(def (values y z w) (my-fun)) ; sets y = 1, z = 2, w = 3
#+END_SRC


