lang-spec.html


<div id="outline-container-org2e3b089" class="outline-3">
<h3 id="org2e3b089"><span class="section-number-3">6.2</span> (Proposed) <code>#</code>-Syntax for Collections</h3>
<div class="outline-text-3" id="text-6-2">
<p>
So, we turn <code>#</code> into a syntax character and give <code>#()</code>, <code>#[]</code>, <code>#{}</code>, etc. syntactic
meanings.
</p>

<p>
There are a couple of options for how to do this:
</p>
<ul class="org-ul">
<li><code>#()</code> could expand to <code>(values)</code> (if we implement multiple values as proposed), or
to a set or tuple type.</li>
<li><code>${}</code> could expand to <code>(Set)</code> or <code>(Vector)</code>, or if we add typed tables, <code>#{type ...}</code>
could be used to construct types (e.g. <code>(construct type ...)</code>).</li>
<li><code>#[]</code> could expand to <code>(Vector)</code> or <code>(values)</code>.</li>
<li>Alternatively, if we lean into lazy data structures, then the <code>#</code> structures
could be the respective lazy equivalents</li>
</ul>

<p>
I'm most likely to set <code>#[]</code> to <code>(Vector ...)</code>. Using <code>#{}</code> for <code>(Set ...)</code> would also
make sense, but if typed tables get added, those will be more important for
sets. If multiple values get added, then the <code>#()</code> syntax should really be used
for that.
</p>

<p>
Drawbacks: this would make hash into a special character as opposed to just a
symbol constituent.
</p>
</div>
</div>


<div id="outline-container-org7612b20" class="outline-3">
<h3 id="org7612b20"><span class="section-number-3">6.3</span> Global Names for Definitions</h3>
<div class="outline-text-3" id="text-6-3">
<p>
A global variable name consists of a forward slash, the full namespace name, a
colon, and an identifier in that namespace, in that order. For example:
</p>
<div class="org-src-container">
<pre class="src src-fn">/fn/builtin:+
</pre>
</div>
<p>
is the global name for the builtin <code>+</code> function.
</p>

<p>
This is implemented as follows:
</p>
<ul class="org-ul">
<li>make it illegal to name namespaces beginning with a slash</li>
<li>make it illegal to create variables whose names contain colons.
(Alternatively, can make it illegal to create variables whose names start with
a slash).</li>
<li>variable names that have this syntax are evaluated a little differently</li>
</ul>

<p>
To get the global name of a symbol, we'll provide a builtin function called
<code>global-name</code>, e.g. <code>(global-name '+)</code> is <code>'/fn/builtin:+</code>.
</p>
</div>
</div>


<div id="outline-container-org0641665" class="outline-3">
<h3 id="org0641665"><span class="section-number-3">6.4</span> (Proposed) <code>,:</code>-Syntax for Global Names in Quasiquote</h3>
<div class="outline-text-3" id="text-6-4">
<p>
The syntax <code>,:var</code> expands <code>(unquote (global-name 'var))</code>. This will be necessary
for all non-builtin functions included in macro expansions, (and should be used
for builtin functions too).
</p>
</div>
</div>


<div id="outline-container-org745fc2d" class="outline-3">
<h3 id="org745fc2d"><span class="section-number-3">6.5</span> (Proposed) Multiple Return Values</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Idk, these are useful in Matlab and Haskell has this sort of thing going on with
its tuples.
</p>

<p>
So we create a multiple values object with <code>(values x y ...)</code>. These objects are
tricky; as soon as they get used they collapse to a single value (in this case
the result of expression <code>x</code>).
</p>

<p>
However, when a multiple values object is returned to a <code>let</code> or <code>def</code>, then we can
use destructuring to access the additional values. For example:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">defn</span> <span style="color: #cd9b1d;">my-fun</span> <span style="color: #7388d6;">()</span> <span style="color: #7388d6;">(</span>values 1 2 3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> x <span style="color: #7388d6;">(</span>my-fun<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; sets x = 1</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #7388d6;">(</span>values y z<span style="color: #7388d6;">)</span> <span style="color: #586e75; font-style: italic;">; sets y = 1, z = 2</span>
<span style="color: #7388d6;">(</span><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #909183;">(</span>values y z w<span style="color: #909183;">)</span> <span style="color: #586e75; font-style: italic;">; sets y = 1, z = 2, w = 3</span>
</pre>
</div>

<p>
Together with #-syntax for values, this might be a very useful feature. It would
look like this:
</p>
<div class="org-src-container">
<pre class="src src-fn"><span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> #<span style="color: #7388d6;">(</span>y z<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>my-fun<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; sets y = 1, z = 2</span>
<span style="color: #707183;">(</span><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #7388d6;">(</span>values y z w<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>my-fun<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #586e75; font-style: italic;">; sets y = 1, z = 2, w = 3</span>
</pre>
</div>
</div>
</div>
