lang-spec.tex


\subsection{(Proposed) \texttt{\#}-Syntax for Collections}
\label{sec:org6d1883e}

So, we turn \texttt{\#} into a syntax character and give \texttt{\#()}, \texttt{\#[]}, \texttt{\#\{\}}, etc. syntactic
meanings.

There are a couple of options for how to do this:
\begin{itemize}
\item \texttt{\#()} could expand to \texttt{(values)} (if we implement multiple values as proposed), or
to a set or tuple type.
\item \texttt{\$\{\}} could expand to \texttt{(Set)} or \texttt{(Vector)}, or if we add typed tables, \texttt{\#\{type ...\}}
could be used to construct types (e.g. \texttt{(construct type ...)}).
\item \texttt{\#[]} could expand to \texttt{(Vector)} or \texttt{(values)}.
\item Alternatively, if we lean into lazy data structures, then the \texttt{\#} structures
could be the respective lazy equivalents
\end{itemize}

I'm most likely to set \texttt{\#[]} to \texttt{(Vector ...)}. Using \texttt{\#\{\}} for \texttt{(Set ...)} would also
make sense, but if typed tables get added, those will be more important for
sets. If multiple values get added, then the \texttt{\#()} syntax should really be used
for that.

Drawbacks: this would make hash into a special character as opposed to just a
symbol constituent.


\subsection{Global Names for Definitions}
\label{sec:org9fae995}

A global variable name consists of a forward slash, the full namespace name, a
colon, and an identifier in that namespace, in that order. For example:
\begin{verbatim}
/fn/builtin:+
\end{verbatim}
is the global name for the builtin \texttt{+} function.

This is implemented as follows:
\begin{itemize}
\item make it illegal to name namespaces beginning with a slash
\item make it illegal to create variables whose names contain colons.
(Alternatively, can make it illegal to create variables whose names start with
a slash).
\item variable names that have this syntax are evaluated a little differently
\end{itemize}

To get the global name of a symbol, we'll provide a builtin function called
\texttt{global-name}, e.g. \texttt{(global-name '+)} is \texttt{'/fn/builtin:+}.


\subsection{(Proposed) \texttt{,:}-Syntax for Global Names in Quasiquote}
\label{sec:orgc8beef5}

The syntax \texttt{,:var} expands \texttt{(unquote (global-name 'var))}. This will be necessary
for all non-builtin functions included in macro expansions, (and should be used
for builtin functions too).


\subsection{(Proposed) Multiple Return Values}
\label{sec:org223188a}

Idk, these are useful in Matlab and Haskell has this sort of thing going on with
its tuples.

So we create a multiple values object with \texttt{(values x y ...)}. These objects are
tricky; as soon as they get used they collapse to a single value (in this case
the result of expression \texttt{x}).

However, when a multiple values object is returned to a \texttt{let} or \texttt{def}, then we can
use destructuring to access the additional values. For example:
\begin{verbatim}
(defn my-fun () (values 1 2 3))
(def x (my-fun)) ; sets x = 1
(def (values y z) ; sets y = 1, z = 2
(def (values y z w) ; sets y = 1, z = 2, w = 3
\end{verbatim}

Together with \#-syntax for values, this might be a very useful feature. It would
look like this:
\begin{verbatim}
(def #(y z) (my-fun)) ; sets y = 1, z = 2
(def (values y z w) (my-fun)) ; sets y = 1, z = 2, w = 3
\end{verbatim}
