lang-spec.org
** Schemas, Metatables, and Table Calls

Tables are gonna get a metatable like in Lua. This will simply be a second,
invisible table, accessible via a ~metatable~ builtin function.

The ~metatable~ may contain these two things (more may be added):
- an *on-call function*. If set, this allows the table to be called like a
  function by invoking the on-call function on the given arguments.
- a *schema* for the table

The on-call function is self-explanatory:
#+BEGIN_SRC fn
(def tab { 'value 27 })
(set! (get (metatable tab) 'on-call) 
      (fn (x) (+ x tab.value)))
(tab 42) ;=> 69
#+END_SRC

Schemas are objects describing the following information:
- a schema name that can be used to do pattern matching on this kind of object
- optional type annotations for values in the table
- pattern matching functions
- (Proposed) protocols implemented by the table. (Note: this may belong directly
  in the metatable?)

So, giving a table a schema provides:
- data validation
- accessors
- pattern matching
All of this with very little overhead.

So giving a table a schema is a big deal. It basically promotes the the object
from a table to a more complex type. For this reason, we call tables with
non-nil schemas *structures*. It is intended that structures will be used
extensively in Fn as the main way to organize data.

Through use of variable capture, functions contained in a table may access or
mutate that table. This makes it possible to implement full, stateful
object-oriented programming using structures containing functions, although I
don't know why you'd want to.

However, we functional programmers still benefit from structures containing
functions. In particular, this is a handy way to simultaneously save typing and
avoid namespace pollution. For instance, consider:
#+BEGIN_SRC fn
;; database structure has a send function
(my-db.query my-query)
;; vs. a global function to do it
(db-query my-db my-query)
#+END_SRC
Moreover, we see this gives us something Python calls "duck typing". Any
table with an appropriate query function will work in the first expression
above. I think that's pretty neat.

You could even implement ADTs a la Haskell using schemas, but I don't expect
they'd be nearly as useful without that sweet, sweet type system.


** (Proposed) Table Immutability Rules

It would be really great to have some guarantee of a table's immutability.

Mutable tables are great for initialization and certain types of imperative
algorithms. However, immutable tables are better for functional programming, and
we like that.

I propose the following changes:
- tables are immutable by default
- mutable tables may be created via ~(M-Table ...)~, and have mutable metatables
- builtin functions are provided to copy mutable tables to immutable ones and
  vice versa

In addition, it may be possible to allow mutable tables to be made immutable in
certain situations, in order to save the copying operation. In order to prevent
this from wreaking havoc, it might be best to provide some builtin function that
exposes this functionality. E.g. ~(build-table x)~ where x is a function that
takes a mutable table, mutates it, and returns it at the end. Provided the
return value is the same table as was put in, it is then converted to a mutable
table directly, with no copying.
