lang-spec.tex


\subsection{Schemas, Metatables, and Table Calls}
\label{sec:org34618cf}

Tables are gonna get a metatable like in Lua. This will simply be a second,
invisible table, accessible via a \texttt{metatable} builtin function.

The \texttt{metatable} may contain these two things (more may be added):
\begin{itemize}
\item an \textbf{on-call function}. If set, this allows the table to be called like a
function by invoking the on-call function on the given arguments.
\item a \textbf{schema} for the table
\end{itemize}

The on-call function is self-explanatory:
\begin{verbatim}
(def tab { 'value 27 })
(set! (get (metatable tab) 'on-call) 
      (fn (x) (+ x tab.value)))
(tab 42) ;=> 69
\end{verbatim}

Schemas are objects describing the following information:
\begin{itemize}
\item a schema name that can be used to do pattern matching on this kind of object
\item optional type annotations for values in the table
\item pattern matching functions
\item (Proposed) protocols implemented by the table. (Note: this may belong directly
in the metatable?)
\end{itemize}

So, giving a table a schema provides:
\begin{itemize}
\item data validation
\item accessors
\item pattern matching
\end{itemize}
All of this with very little overhead.

So giving a table a schema is a big deal. It basically promotes the the object
from a table to a more complex type. For this reason, we call tables with
non-nil schemas \textbf{structures}. It is intended that structures will be used
extensively in Fn as the main way to organize data.

Through use of variable capture, functions contained in a table may access or
mutate that table. This makes it possible to implement full, stateful
object-oriented programming using structures containing functions, although I
don't know why you'd want to.

However, we functional programmers still benefit from structures containing
functions. In particular, this is a handy way to simultaneously save typing and
avoid namespace pollution. For instance, consider:
\begin{verbatim}
;; database structure has a send function
(my-db.query my-query)
;; vs. a global function to do it
(db-query my-db my-query)
\end{verbatim}
Moreover, we see this gives us something Python calls "duck typing". Any
table with an appropriate query function will work in the first expression
above. I think that's pretty neat.

You could even implement ADTs a la Haskell using schemas, but I don't expect
they'd be nearly as useful without that sweet, sweet type system.


\subsection{(Proposed) Table Immutability Rules}
\label{sec:orge599d70}

It would be really great to have some guarantee of a table's immutability.

Mutable tables are great for initialization and certain types of imperative
algorithms. However, immutable tables are better for functional programming, and
we like that.

I propose the following changes:
\begin{itemize}
\item tables are immutable by default
\item mutable tables may be created via \texttt{(M-Table ...)}, and have mutable metatables
\item builtin functions are provided to copy mutable tables to immutable ones and
vice versa
\end{itemize}

In addition, it may be possible to allow mutable tables to be made immutable in
certain situations, in order to save the copying operation. In order to prevent
this from wreaking havoc, it might be best to provide some builtin function that
exposes this functionality. E.g. \texttt{(build-table x)} where x is a function that
takes a mutable table, mutates it, and returns it at the end. Provided the
return value is the same table as was put in, it is then converted to a mutable
table directly, with no copying.
\end{document}